[
    {
        "title": "billy woods Announces New Album Golliwog, Shares New Song “Misery”",
        "created_at": "2025-03-12",
        "description": "The Backwoodz Studioz founder and rapper worked with Kenny Segal, Elucid, DJ Haram, El-P, Despot, the Alchemist, and more on his follow-up to Maps and We Buy Diabetic Test Strips",
        "authors": "Matthew Strauss",
        "url": "https://pitchfork.com/news/billy-woods-announces-new-album-golliwog-shares-new-song-misery-listen",
        "text": "Backwoodz Studioz founder and rapper billy woods has announced a new album: Golliwog is out May 9. The lead single is a collaboration with producer Kenny Segal called “Misery.” Check it out below.\nDiscussing his new album in a statement, woods said, “When I was nine years old I wrote a story about an evil golliwog. My mother read it and told me it was overly derivative and needed some work. Here we are.”\nIn addition to Segal, Golliwog has production from the Alchemist, El-P, Shabaka Hutchings, DJ Haram, Conductor Williams, and others, along with guest verses from Armand Hammer’s Elucid, Definitive Jux alumnus Despot, New Orleans rapper Cavalier, and more.\nGolliwog will follow woods’ two standout collaborative projects from 2023: Maps (with Kenny Segal) and We Buy Diabetic Test Strips (with Elucid). Read about Maps at No. 14 in Pitchfork’s “The 100 Best Albums of the 2020s So Far.”\nGolliwog:\n01 Jumpscare [ft. Steel Tipped Dove]\n02 Star87 [ft. Conductor Williams]\n03 Misery [ft. Kenny Segal]\n04 Blk Xmas [ft. Bruiser Wolf and Sadhugold]\n05 Waterproof Mascara [ft. Preservation]\n06 Counterclockwise [ft. The Alchemist]\n07 Corinthians [ft. Despot and El-P]\n08 Pitchforks & Halos [ft. Kenny Segal]\n09 All These Worlds Are Yours [ft. Elucid, DJ Haram and Shabaka Hutchings]\n10 Maquiladoras [ft. Al.Divino and Saint Abdullah]\n11 A Doll Fulla Pins [ft. Yolanda Watson and Jeff Markey]\n12 Golgotha [ft. Messiah Musik]\n13 Cold Sweat [ft. Ant]\n14 Blk Zmby [ft. Steel Tipped Dove]\n15 Make No Mistake [ft. Messiah Musik]\n16 Born Alone [ft. Kenny Segal]\n17 Lead Paint Test [ft. Elucid, Cavalier and Willie Green]\n18 Dislocated [ft. Elucid and Human Error Club]",
        "image": "https://media.pitchfork.com/photos/67cf1cd9862b32ee768485c9/16:9/w_1280,c_limit/billy-woods.jpeg",
        "categories": [
            "news"
        ],
        "source": "pitchfork",
        "topic": "music",
        "estimatedReadingTime": 1
    },
    {
        "title": "C2C Festival Founder Sergio Ricciardone Dies at 53",
        "created_at": "2025-03-12",
        "description": "Ricciardone ran the Turin festival formerly known as Club to Club for more than two decades, helping it evolve into an international locus for vanguard music",
        "authors": "Jazz Monroe",
        "url": "https://pitchfork.com/news/c2c-festival-founder-sergio-ricciardone-dies-at-58",
        "text": "Sergio Ricciardone, the founder and director of the internationally lauded Turin festival C2C, died yesterday (March 11), the festival has announced. No cause of death was given. In a statement, the festival offered condolences to his family, adding, “Sergio's vision will continue to light our path, his presence will guide us in difficult times.” Ricciardone was 53 years old.\nIn the early 2000s, Ricciardone worked with Roberto Spallacci and Giorgio Valletta to conceptualize a multi-venue festival that celebrated Turin’s clubs and forward electronic music scene. Founded as Club to Club in 2002, the festival eventually shifted its main location to Turin’s Lingotto Fiere, a historic site once heralded as a symbol of Italian futurism. Through the festival—which takes place the same week as Turin’s Artissima contemporary art fair—Ricciardone aspired to bridge music and art across the city, particularly in an era when electronic genres were probing questions of the body and identity in the deconstructed techno era. Club to Club specialized in striking visual sets, backing repeat headliners like Caribou’s Dan Snaith and Nicolás Jaar with showcases for the likes of Elysia Crampton and festival house act Arca, who premiered her live-vocal transformation at the 2016 edition.\nRicciardone curated the festival’s audience as carefully as his lineups, balancing hedonist and epicurean contingents by revealing certain marquee artists only after tickets had sold out. He was ambitious, guided by a utopian vision for art, sometimes to the point of folly. After clipping the festival’s name to C2C, he spoke in recent years of abolishing the title altogether and replacing it with a symbol, the ambiguous winged figure that became its logo.\nIn subsequent years, Ricciardone and artistic director Guido Savini shook off C2C’s reputation for heady electronic sounds and branded itself as an avant-pop festival, as documented in its collection of original essays by authors including Kode9 and Simon Reynolds. Last year’s ever-eclectic bill featured Hessle Audio, Caroline Polachek, and billy woods; the inaugural New York edition is set to take place in May, with Oneohtrix Point Never, Nala Sinephro, Evilgiane, and Two Shell among the performers.",
        "image": "https://media.pitchfork.com/photos/67d185226f5be9046f703e77/16:9/w_1280,c_limit/sergio%20ricciardone%20c2c.jpg",
        "categories": [
            "news"
        ],
        "source": "pitchfork",
        "topic": "music",
        "estimatedReadingTime": 1
    },
    {
        "title": "Cocoa Tea, Beloved and Prolific Reggae Artist, Dies at 65",
        "created_at": "2025-03-12",
        "description": "The Jamaican singer released countless singles in the 1980s and 1990s and regained popularity in 2008 with his political single “Barack Obama”",
        "authors": "Madison Bloom",
        "url": "https://pitchfork.com/news/cocoa-tea-beloved-and-prolific-reggae-artist-dies-at-65",
        "text": "Colvin Scott, the influential reggae artist who performed as Cocoa Tea, has died. The singer’s wife, Malvia Scott, confirmed the news to Jamaican news outlet The Gleaner, stating that her husband died Tuesday morning (March 11) at a hospital in Fort Lauderdale, Florida, following cardiac arrest. He was 65 years old.\nCocoa Tea was diagnosed with lymphoma in 2019, and he had recently been dealing with pneumonia, Malvia Scott told The Gleaner. She added, “He was definitely very brave. He was positive throughout it all.”\nColvin George Scott was born in the fishing village of Rocky Point, in Jamaica’s Clarendon Parish. Though he started recording singles as Calvin Scott at age 14, his best known work emerged in the 1980s and 1990s, when he took on the moniker Cocoa Tea (sometimes stylized as Coco Tea). Early hits under his new stage name included “Rocking Dolly” and “I Lost My Sonia.”\nAfter a prolific output in the 1980s, the following decade found Cocoa Tea reaching wider audiences with songs like 1990’s “Rikers Island,” which was later reworked into a dancehall track by Nardo Ranks called “Me No Like Rikers Island.”\nIn 1997, Cocoa Tea launched his own record label, Roaring Lion, after releasing dozens of singles for imprints like Greensleeves, Jammy’s, and Mr. Doo. In addition to releasing his own music, Cocoa Tea issued music by Buju Banton, Cutty Ranks, Sizzla, and many others.\nIn March 2008, Cocoa Tea released one of his most popular songs to-date: “Barack Obama.” The chorus featured simply the now-former President’s name repeated six times, as a musical endorsement of Obama’s candidacy at the time.\nIn an interview, following the release of “Barack Obama,” Cocoa Tea called the then-senator “exception to all politicians all over the world.” “I am looking for the change that this man has articulated,” Cocoa Tea said. “I want to see a change from global warming. I want to see a change from all these rising food prices.” He added, “Whatever happens in Washington indirectly affects all of us.”",
        "image": "https://media.pitchfork.com/photos/67d1aaef7ef1ebb3efe75e7b/16:9/w_1280,c_limit/GettyImages-876966386.jpg",
        "categories": [
            "news"
        ],
        "source": "pitchfork",
        "topic": "music",
        "estimatedReadingTime": 1
    },
    {
        "title": "Grateful Dead Releasing 60-CD Box Set for 60th Anniversary, Share Live Songs",
        "created_at": "2025-03-12",
        "description": "Unreleased performances from shows between 1969 and 1994 make up the mammoth Enjoying the Ride",
        "authors": "Jazz Monroe",
        "url": "https://pitchfork.com/news/grateful-dead-releasing-60-cd-box-set-for-60th-anniversary-share-live-songs-listen",
        "text": "In typical Grateful Dead fashion, Grateful Dead have compiled 60 hours’ worth of live albums to celebrate their 60th anniversary with a 60xCD box set. Out May 30, Enjoying the Ride comprises recordings of sets played between 1969 and 1994, including at Winterland Ballroom and Madison Square Garden; “virtually” all of the music is previously unreleased, according to a press release. Among the 20 shows, amounting to some 450 songs, are 17 concerts presented in full. An abridged version, The Music Never Stopped, compiles at least one song from each venue across three CDs or six LPs. That’s out via Rhino on May 30. Find three newly released live songs below.\nGrateful Dead archivist and legacy manager David Lemieux, who curated the set, said in the press release, “Going to see the Grateful Dead, following them from city to city, was likened to the modern equivalent of running away and joining the circus. These 20 venues are where the circus took us, and the show was something we never wanted to miss.”\nRead Pitchfork’s new Sunday Review of Jerry Garcia’s first solo studio album, 1972’s Garcia.\nAll products featured on Pitchfork are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.\nThe Music Never Stopped (Live):\n01 The Music Never Stopped (Live at Philadelphia Spectrum, Philadelphia, PA, 5/13/1978)\n02 Althea (Live at Hartford Civic Center, Hartford, CT, 3/14/1981)\n03 Playing in the Band (Live at Nassau Veterans Memorial Coliseum, Uniondale, NY, 3/16/1973)\n04 Hard to Handle (Live at Fillmore East, New York, NY, 4/25/1971)\n05 Wharf Rat (Live at Madison Square Garden, New York, NY, 9/16/1987)\n06 Doin’ That Rag (Live at Fillmore West, San Francisco, CA, 6/5/1969)\n07 My Brother Esau (Live at Frost Amphitheatre, Stanford University, Palo Alto, CA, 8/20/1983)\n08 Deal (Live at Shoreline Amphitheatre, Mountain View, CA, 5/12/1991)\n01 Scarlet Begonias (Live at Greek Theatre, Berkeley, CA, 7/13/1984)\n02 Touch of Grey (Live at Greek Theatre, Berkeley, CA, 7/13/1984)\n03 Fire on the Mountain (Live at Greek Theatre, Berkeley, CA, 7/13/1984)\n04 Lazy Lightning (Live at Alpine Valley Music Theatre, East Troy, WI, 8/23/1980)\n05 Supplication (Live at Alpine Valley Music Theatre, East Troy, WI, 8/23/1980)\n06 Attics of My Life (Live at Boston Garden, Boston, MA, 10/3/1994)\n07 Estimated Prophet (Live at Red Rocks Amphitheatre, Morrison, CO, 8/12/1979)\n08 Eyes of the World (Live at Red Rocks Amphitheatre, Morrison, CO, 8/12/1979)\n09 Brown-Eyed Women (Live at Winterland, San Francisco, CA, 3/20/1977)\n01 Truckin’ (Live at Deer Creek Music Center, Noblesville, IN, 7/15/1989)\n02 Smokestock Lightnin’ (Live at Deer Creek Music Center, Noblesville, IN, 7/15/1989)\n03 Big Boy Pete (Live at the Henry J. Kaiser Convention Center, Oakland, CA, 11/21/1985)\n04 Bird Song (Live at Boston Music Hall, Boston, MA, 9/15/1972)\n05 Let It Grow (Live at Hampton Coliseum, Hampton, VA, 5/1/1981)\n06 Black Muddy River (Live at Oakland Coliseum Arena, Oakland, CA, 12/27/1989)\n07 Days Between (Live at Capital Centre, Landover, MD, 3/17/1993)\n08 Not Fade Away (Live at Capitol Theatre, Port Chester, NY, 2/20/1971)\n09 Goin’ Down the Road Feeling Bad (Live at Capitol Theatre, Port Chester, NY, 2/20/1971)\n10 Not Fade Away (Reprise) (Live at Capitol Theatre, Port Chester, NY, 2/20/1971)",
        "image": "https://media.pitchfork.com/photos/67d18380e3b6c12b4b123115/16:9/w_1280,c_limit/Grateful-Dead.jpeg",
        "categories": [
            "news"
        ],
        "source": "pitchfork",
        "topic": "music",
        "estimatedReadingTime": 2
    },
    {
        "title": "Haim Return With New Song “Relationships”",
        "created_at": "2025-03-12",
        "description": "Rostam Batmanglij and Danielle Haim co-produced the band’s comeback single, which arrives with a music video directed by Camille Summers-Valli",
        "authors": "Madison Bloom",
        "url": "https://pitchfork.com/news/haim-return-with-new-song-relationships-watch-the-video",
        "text": "Last month, the sisters Haim graced the internet with a snippet of new music—a breezy pop track that questioned the point of “fucking relationships.” Now, the Los Angeles trio has released the song in full. It’s called “Relationships.” The song was produced by Rostam Batmanglij and Danielle Haim, and marks Haim’s first piece of new music since 2023, when they contributed “Home” to Barbie the Album. “Relationships” arrives with a music video directed by Camille Summers-Valli and starring Queer actor Drew Starkey. Check it out below.\nSince their initial TikTok teaser, Haim have been posting additional snippets of the song, usually accompanied by the sisters dancing and lip-syncing along. They’ve also shared visual hints at the song’s theme, such as photos of bracelets that are stamped with different relationship statuses: “Single,” “I’m Taken,” and “I’m ???”\nAccording to a press release, “Relationships” is the first taste of a forthcoming new Haim album. Haim issued their most recent studio album, Women in Music Pt. III, in 2020. The sisters followed that record with a string of one-off singles such as “Cherry Flavored Stomach Ache” and “Lost Track.” They also cut the original song “Feel the Thunder” for the animated film The Croods: A New Age, and shared remixes with Toro y Moi and one Taylor Swift.\nHaim have been rather mum about new music in recent years, save for a brief mention of it in a 2023 interview with BBC Radio 6’s Lauren Laverne. During that appearance, the sisters played Jai Paul’s “Jasmine” and then hinted that they were possibly working with the famously reclusive producer. “We played Jai Paul earlier; we might’ve been in the studio with him,” they said. “We may or may not have been in the studio with him…. Cannot confirm or deny.”\nRevisit the 2020 piece “RIYL: Haim’s Women in Music Pt. III.” Plus, read the new review of “Relationships.”",
        "image": "https://media.pitchfork.com/photos/67d1b53f8216d72294bf2792/16:9/w_1280,c_limit/Haim.jpg",
        "categories": [
            "news"
        ],
        "source": "pitchfork",
        "topic": "music",
        "estimatedReadingTime": 1
    },
    {
        "title": "John Lennon and Yoko Ono Documentary One to One Gets First Trailer",
        "created_at": "2025-03-12",
        "description": "The Kevin Macdonald–directed movie documents the couple’s lives in the lead-up to the couple’s only concert together",
        "authors": "Jazz Monroe",
        "url": "https://pitchfork.com/news/john-lennon-and-yoko-ono-documentary-one-to-one-gets-first-trailer-watch",
        "text": "One to One: John & Yoko, a new documentary from director Kevin Macdonald, goes behind the curtain of John Lennon and Yoko Ono’s lives in Greenwich Village in the early 1970s, culminating in newly restored footage of the couple’s 1972 concerts at Madison Square Garden. Below, watch the first trailer for the film, ahead of its wide release on Imax on April 11.\nThe two-night One to One benefit concerts were not only Lennon and Ono’s sole full shows together (back by Plastic Ono Elephant’s Memory Band), but also Lennon’s first and only post-Beatles concerts. Sean Ono Lennon produced and remixed the concert audio for the movie, which also collages together home movies and phone calls, as well as footage of an intricate reconstruction of the couple’s Bank Street apartment and snippets of 1970s television.",
        "image": "https://media.pitchfork.com/photos/67d1b949d0254777a5bd339b/16:9/w_1280,c_limit/john%20lennon%20and%20yoko%20ono%20one%20to%20one.jpeg",
        "categories": [
            "news"
        ],
        "source": "pitchfork",
        "topic": "music",
        "estimatedReadingTime": 0
    },
    {
        "title": "Listen to Lucy Dacus’ New Song “Talk”",
        "created_at": "2025-03-12",
        "description": "Dacus co-produced her new Forever Is a Feeling single with Blake Mills",
        "authors": "Matthew Strauss",
        "url": "https://pitchfork.com/news/listen-to-lucy-dacus-new-song-talk",
        "text": "Lucy Dacus another song from the new album Forever Is a Feeling. Today’s new single, “Talk,” follows “Limerance,” “Ankles,” and “Best Guess.” Check out the track, which Dacus co-produced with Blake Mills, below.\nForever Is a Feeling—out March 28—is Lucy Dacus’ fourth solo studio album. Revisit the review of Dacus’ third record, 2021’s Home Video.",
        "image": "https://media.pitchfork.com/photos/67d1b90f0bef48fc58a77edd/16:9/w_1280,c_limit/Lucy-Dacus.jpeg",
        "categories": [
            "news"
        ],
        "source": "pitchfork",
        "topic": "music",
        "estimatedReadingTime": 0
    },
    {
        "title": "New Spinal Tap II Movie Finally Gets Release Date",
        "created_at": "2025-03-12",
        "description": "The long-awaited sequel to 1984’s This Is Spinal Tap arrives in September",
        "authors": "Matthew Strauss",
        "url": "https://pitchfork.com/news/new-spinal-tap-ii-movie-finally-gets-release-date",
        "text": "Spinal Tap II, the long-awaited and long-teased sequel to Rob Reiner’s classic 1984 movie This Is Spinal Tap, finally has a new release date. The film—originally set for a March 2024 release but delayed due to the Hollywood strikes of 2023—will get released on Friday, September 12, 2025, according to Deadline. Watch a teaser for the new movie below.\nBleecker Street is handling U.S. distribution for Spinal Tap II. In a statement, Reiner, who directed the movie and reprises his role as Martin “Marty” Di Bergi, said, “So happy to be working with the folks at Bleecker Street who are passionate about keeping Tap’s legacy alive and happy to give Marty DiBergi another shot at relevancy.”\nMichael McKean, Christopher Guest, and Harry Shearer are returning to play the fictional members of Spinal Tap: David St. Hubbins, Nigel Tufnel, and Derek Smalls, respectively. The movie will also feature Paul MCartney, Elton John, and others.",
        "image": "https://media.pitchfork.com/photos/67d1c2fce3b6c12b4b123173/16:9/w_1280,c_limit/Spinal-Tap.jpeg",
        "categories": [
            "news"
        ],
        "source": "pitchfork",
        "topic": "music",
        "estimatedReadingTime": 0
    },
    {
        "title": "Sunny Day Real Estate Announce 2025 Tour",
        "created_at": "2025-03-12",
        "description": "The Seattle emo band will perform across the United States, Canada, and England in the summer",
        "authors": "Nina Corcoran",
        "url": "https://pitchfork.com/news/sunny-day-real-estate-announce-2025-tour",
        "text": "Sunny Day Real Estate have announced a 2025 tour. The veteran Seattle emo band will perform across the United States, Canada, and England in the summer, with the trek planned to kick off on May 28 in Montreal, Quebec. Check out a complete list of Sunny Day Real Estate’s tour dates below.\nThe band’s upcoming live shows are split into two legs. The first takes place from May on through June, and brings Sunny Day Real Estate across the three countries, ending on June 14 in Manchester, England. After a short summer break, the band picks it back up on September 3, in Tacoma, Washington, and stays on the road that month through September 24 in Vancouver, British Columbia.\nLast year, Sunny Day Real Estate shared “Novum Vetus,” their first new song in a decade. The seven-minute track was originally conceived in 1997 when the band first reunited to record How It Feels to Be Something On. Sunny Day Real Estate also released a live re-recorded version of Diary, their iconic 1994 debut, called Diary at London Bridge Studio last May.\nRead about How It Feels to Be Something On in “The 50 Best Albums of 1998” and revisit Ian Cohen’s essay “Sunny Day Real Estate’s Diary at 20.”\nAll products featured on Pitchfork are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.\nSunny Day Real Estate:\n05-28 Montreal, Quebec - Théâtre Beanfield\n05-29 Toronto, Ontario - The Danforth Music Hall\n05-31 Albany, NY - Empire Live\n06-01 Portland, ME - State Theatre\n06-04 Buffalo, NY - Electric City\n06-05 Asbury Park, NJ - Asbury Lanes\n06-07 Richmond, VA - The National\n06-08 Wilmington, DE - The Queen\n06-13 London, England - Outbreak Fest\n06-14 Manchester, UK - Outbreak Fest\n09-03 Tacoma, WA - Spanish Ballroom\n09-06 Boise, ID - Knitting Factory\n09-08 Sacramento, CA - Ace of Spades\n09-10 Santa Cruz, CA - The Catalyst\n09-12 Ventura, CA - Ventura Music Hall\n09-14 Phoenix, AZ - The Van Buren\n09-15 Pioneertown, CA - Pappy & Harriet’s\n09-17 Salt Lake City, UT - The Grand at the Complex Salt Lake City\n09-19 Boulder, CO - Boulder Theater\n09-21 Billings, MT - Pub Station\n09-23 Spokane, WA - Knitting Factory\n09-24 Vancouver, British Columbia - Commodore Ballroom",
        "image": "https://media.pitchfork.com/photos/67d1978fe3b6c12b4b123117/16:9/w_1280,c_limit/GettyImages-1616517576.jpg",
        "categories": [
            "news"
        ],
        "source": "pitchfork",
        "topic": "music",
        "estimatedReadingTime": 1
    },
    {
        "title": "Hamilton Leithauser: This Side of the Island",
        "created_at": "2025-03-12",
        "description": "Read Zach Schonfeld’s review of the album.",
        "authors": "Zach Schonfeld",
        "url": "https://pitchfork.com/reviews/albums/hamilton-leithauser-this-side-of-the-island",
        "text": "Every year, give or take a pandemic furlough, Hamilton Leithauser performs a multi-week residency at Café Carlyle. The tony Upper East Side cabaret lounge is not the natural habitat for an indie-rock veteran—this joint has a dress code (jackets mandatory for gentlemen) and a $95 two-course menu—but it fits with a certain borrowed elegance that has characterized the singer’s work outside the Walkmen. On his first solo album, 2014’s excellent Black Hours, he dallied with late-night strings and marimba, crooning like a Sinatra acolyte in 1961. His 2016 follow-up, a collaboration with Rostam, flirted with flamenco guitar and doo-wop throwbacks, while 2020’s The Loves of Your Life got mileage out of a pleasantly ageless folk-rock sound.\nI wonder, though, what the well-heeled Carlyle clientele will make of This Side of the Island, which injects some welcome grit and aggression into Leithauser’s sound. It’s the first solo record he’s completed since a triumphant Walkmen reunion tour in 2023, and though he’d already begun work on the record at his home studio in Brooklyn, some of that pent-up energy seems to have settled here. Leithauser comes out swinging on “Fist of Flowers,” a song that had been percolating for more than eight years but didn’t feel complete until he brought in backing vocalists for a rollicking “doot-doo” refrain. The pounding rocker “Knockin’ Heart,” one of seven songs completed with the help of Aaron Dessner at his upstate studio, roils and shakes like a You & Me outtake, with Leithauser deploying big hooks and grand promises: “There’s no one who’s gonna need you like I do tonight,” he yowls.\nThe album suggests a loose beachside theme—songs called “Burn the Boats” and “Off the Beach”; Leithauser barefoot in a Hawaiian shirt on the back cover—but not in a restful vacation way, more in an ogling-the-waves-in-a-debaucherous-haze-while-your-life-crumbles way. Anarchic saxophone skitters around the edges of “Ocean Roar,” an off-center ballad memorializing the late Richard Swift, with whom Leithauser is wandering Wilshire Boulevard, lighting up cigars, as the song opens. Those good times are over; a later verse obliquely hints at Swift’s decline: “He used to stress the audience/Now he don’t care what we think.” Dessner’s fingerprints are most palpable on the kitchen-sink production of “Burn the Boats,” which pairs Leithauser’s lovesick ramblings with a big, hulking R&B groove. With a four-on-the-floor beat and backing singers who sound like they got the night off from Steely Dan’s Beacon residency, the track feels like it should collapse under its own weight but never does.",
        "image": "https://media.pitchfork.com/photos/677eac92eab9fc71bdaf7560/16:9/w_1280,c_limit/Hamilton-Leithauser-This-Side-of-the-Island.jpeg",
        "categories": [],
        "source": "pitchfork",
        "topic": "music",
        "estimatedReadingTime": 2
    },
    {
        "title": "Harto Falión / evilgiane: The Hurtless",
        "created_at": "2025-03-13",
        "description": "Read Jude Noel’s review of the album.",
        "authors": "Jude Noel",
        "url": "https://pitchfork.com/reviews/albums/harto-falion-evilgiane-the-hurtless",
        "text": "Harto Falión’s life isn’t just a movie. According to The Hurtless, his new collaborative album with in-demand cloud rap producer and fellow Surf Gang affiliate Evilgiane, it’s also a cartoon and a video game: anything but real. Formerly known as Trip Dixon, Falión is something of a scene veteran, coming up in the mid-2010s alongside emo rap pioneers like Black Kray, Kirblagoop, and Lil Tracy, primarily as a producer of sinister, grime-caked trap beats. With that wave long past, he’s found a place and a new moniker among the disaffected underground upstarts who’ve kept the mumbled, somnambulant sound of Goth Money en vogue. His excellent beat selection and taste in graphic design that could be mistaken for an NBA Street loading screen or MTV2 bumper puts him in convincing company with vanguardists like Xaviersobased and Polo Perks, though Falión’s songwriting lacks the distinct personality that makes their work compelling. Throughout The Hurtless, his expressions of detachment and dissociation are as hollow as the feelings themselves. Listening to the brief 20-minute tape feels like visiting a national park via VR headset, surrounded by beauty while still breathing the stale air of your bedroom.\nFalión’s vocal textures are an ideal match for Evilgiane’s vaporous, meditative production, which dabbles in vintage downtempo ambiance and the skeletal trappings of ’80s minimal wave. Falión backs his lilting delivery with a chorus of multi-tracked hums and moans, which easily melt into lovely keyboard arpeggios that sound like they’ve been lifted from early µ-Ziq. Their synergy is strongest on tracks like “Un Love Able,” when Evilgiane takes the lead, emphasizing bouncy melodies and a bitcrushed flute while Falión phases in and out of focus. On “An Innermission Conducted by Eli & Giane,” he eschews rapping entirely to weave a sort of cyborg Gregorian chant over squelching arpeggios. Though billed as an interlude, the track is one of The Hurtless’ most complete offerings. Falión’s wordless presence takes on a mystic quality, echoing through a twisty, cavernous beat. Distorted flecks of digital percussion sound like they’re dripping from stalactites: the sense of isolation and disembodiment is all-consuming.\nThe Hurtless succeeds at creating a desolate atmosphere. Falión’s writing doesn’t quite meet the moment, often merely asserting the album’s themes without fleshing out the finer details. On multiple tracks, he describes his life as if he’s watching it unfold onscreen; it’s tough to listen to lines like, “[T]hey told me life is just a game, so why you acting like a noob? You better level up, you know my team is OP,” without being reminded of TikToks winkingly lip-synced to Falling in Reverse’s “Game Over.” The title of the drum’n’bass-infused “Like Lain” suggests an exploration of cyberculture and identity inspired by the 1998 anime cult classic Serial Experiments Lain, but the series isn’t even referenced in the lyrics—it’s just another media-centric signifier. When he does offer sensory information to process, describing how he’s “so hungry for this shit [he’s] gnawing off [his] cuticles” on “Don’t Believe ’Em,” or crafting absurd flexes like “the Tris giving me expensive belches,” The Hurtless’ world feels much more lived-in. There’s a fragile beauty on the record’s surface, but the emptiness beneath veers into the uncanny valley.",
        "image": "https://media.pitchfork.com/photos/67c9a9195766da38e013086b/16:9/w_1280,c_limit/Harto-Falion-Evilgiane-The-Hurtless.jpeg",
        "categories": [],
        "source": "pitchfork",
        "topic": "music",
        "estimatedReadingTime": 2
    },
    {
        "title": "JENNIE: Ruby",
        "created_at": "2025-03-12",
        "description": "Read Joshua Minsoo Kim’s review of the album.",
        "authors": "Joshua Minsoo Kim",
        "url": "https://pitchfork.com/reviews/albums/jennie-ruby",
        "text": "Success changed BLACKPINK forever, for better and worse. At the height of their popularity, the Korean girl group shifted their focus towards Western audiences, making diluted songs that felt ready-made for Kidz Bop. It was an honest mistake. For 30 years, K-pop acts rarely contended with the rubric of American pop music, whose stylistic conservatism thwarts K-pop’s compelling genre agnosticism. Authenticity is more heavily scrutinized in A-pop too, and the BLACKPINK members’ solo debuts have looked anemic under this microscope. Rosé’s rosie lacked interiority and LISA’s Alter Ego whiffed its titular premise. Jisoo’s Amortage fared better, but only because it embraced anonymity. JENNIE’s Ruby adopts a similar tack, but the production is more ambitious, the songwriting more accomplished. If JENNIE has the most robust individual musical identity of the quartet, it’s because her songs have a crucial element the others’ lack: They sound good.\nIt is painfully obvious when hearing “like JENNIE” that the BLACKPINK members all needed a song like this, one that translates their tough-girl sound into a blistering new style. Here, JENNIE sings atop a metallic beat that hybridizes baile funk and phonk, and her snarled delivery is especially convincing when it flits between Korean and English. While she hardly flaunts her bilingual prowess elsewhere, “ZEN” offers art-pop pomp with pounding drums that are as traditional as they are imperial. Reminiscent of Lim Kim’s GENERASIAN, it exudes a bracing confidence that overshadows its flimsy lyrics. This is the secret to Ruby: It’s less “fake it till you make it” than “make it so you can fake it.” She lacks the conviction of Doechii on their collaboration “ExtraL,” but the sleek synths, beat switches, and chanted vocals provide enough window dressing to keep you invested.\nJENNIE excels on these tracks because she knows how to play the game. Much like Rihanna, she’s been lambasted for lazy performances and an indifference towards honing her vocals, but she also has enough charisma—a stylish flair—to carry weaker productions. “Mantra” is too minimal for its own good, but JENNIE’s insistent, needling hook forms an earworm by sheer force. “Starlight” is a gaunt, slow-motion PinkPantheress riff, but its introspection is believable because of her impassioned singing. While some tracks are duds—“Twin” is an acoustic ballad with embarrassingly generic details, and “Seoul City” meanders aimlessly—most of Ruby proves she’s a natural. “start a war” is a lighters-up SZA anthem that sidesteps gauche ABG AAVE, her vacillating vocal rhythms mirroring a relationship’s push-pull tensions.\nThe clearest testament to JENNIE’s versatility is that she’s never out of place among her features. She sounds at home on “Handlebars,” an unassailable collaboration with Dua Lipa. Their last song together was an awkward pop Mad Lib, but the two trade verses here as if close friends, bonding over their tendency to crush hard. “Damn Right,” a Mike WiLL Made-It co-production, serves as Ruby’s most sultry moment. Alongside Kali Uchis and Childish Gambino—the latter of whom dons his best André 3000 impression—the three revel in a night of hushed come-ons. When JENNIE delivers the barebones hook (“Damn right, I did that/Damn right, yeah”) like she’s whispering under her breath, her satisfaction is palpable. It recalls the album’s f(x)-like intro, built on little more than snatches of her voice. These moments embody Ruby’s effortless charm: Sometimes, JENNIE’s presence is enough.\nAll products featured on Pitchfork are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.",
        "image": "https://media.pitchfork.com/photos/67c9d295c4d5104730240671/16:9/w_1280,c_limit/JENNIE:%20Ruby.jpg",
        "categories": [],
        "source": "pitchfork",
        "topic": "music",
        "estimatedReadingTime": 2
    },
    {
        "title": "Kedr Livanskiy: Myrtus Myth",
        "created_at": "2025-03-13",
        "description": "Read Sue Park’s review of the album.",
        "authors": "Sue Park",
        "url": "https://pitchfork.com/reviews/albums/kedr-livanskiy-myrtus-myth",
        "text": "World-building comes naturally to Yana Kedrina. As Kedr Livanskiy, the Moscow singer-producer has released three albums of dark, evocative electro pop rooted in a diverse spread of electronic influences: techno, IDM, garage, ambient, and more. With her ever-changing sound, Livanskiy has carved out a distinct lane for herself: an artist less beholden to explicit formalism or realism than, in her own words, the “transformation, deconstruction, and the escapism” of it all. It’s no surprise that Myrtus Myth, her fourth LP, once again represents a departure from her previous work. What is surprising, though, is the album’s general sense of restraint, even tameness, shelving Livanskiy’s signature club thump for dream pop that’s both well done and well-worn.\nThis is Livanskiy’s most extensive collaboration as a solo artist with Flaty; while the Gost Zvuk-affiliated producer has written and produced for her last two albums, this time around he co-wrote and produced Livanskiy’s entire record. Myrtus Myth is operatic in tone and scope, exploring grief and hopelessness as Livanskiy’s soaring vocals take us through epic scenes of beasts, angels, and the cosmos. The album embraces the idea of mythological narrative as a throughline of the human condition, exploring loss through references to stories like that of Orpheus and Eurydice and the Hindu concept of Kali Yuga (the dark age before the end of the world). Regarding the album’s subject matter, Livanskiy has noted that “the last couple of years have been incredibly difficult for many people on earth”; if a more universal message is the goal, maybe it makes sense for Myrtus Myth to show us Livanskiy at her most accessible.\nAccessible can be a good thing, especially the way Livanskiy flips it. While we’ve previously heard her craft some of her catchiest hooks over woozy house grooves, like on 2019’s “Sky Kisses,” Myrtus Myth gives us some good old-fashioned, hot-off-the-airwaves capital-P Pop. On her last solo album, Liminal Soul, Livanskiy teased her straightforward pop chops on “Boy”; here, she leans more fully into ’70s- and ’80s-inspired songwriting, most notably on singles “Anna” and “Spades on Hearts.” “Agata Dreams” is tinged with a little Everything But the Girl until the beat really starts chattering. With a stronger emphasis on live instruments, these tracks come to life in a surprisingly commanding manner, suggesting a captivating stage presence rather than an infectious dancefloor buzz.\nWhere Myrtus Myth excels is when Livanskiy accesses the softness of dream pop within her usual electronic experiments. On the subtly jungle-influenced “Night Trains,” what might be the world’s gentlest breakbeat skitters steadily under churchlike synths and a wispy vocal refrain: “Leave on familiar trains, leaving cities.” It feels both minimal and rich, capturing the skill and assuredness in the development of her craft and style. On the flipside, “Zver” embraces a more maximal sound than before; throughout a dirgelike take on a jangle-pop melody, misty strings, brass, and vocals echo, swell, and swirl into one another like smoke. Livanskiy has previously mastered playing outside the bounds of genre convention, and to hear her experimenting within them brings a new and welcome dimension to her abilities as a songwriter and producer.",
        "image": "https://media.pitchfork.com/photos/67c86f0670aebb7b5b6c90df/16:9/w_1280,c_limit/Kedr%20Livanskiy:%20Myrtus%20Myth.jpg",
        "categories": [],
        "source": "pitchfork",
        "topic": "music",
        "estimatedReadingTime": 2
    },
    {
        "title": "The Tubs: Cotton Crown",
        "created_at": "2025-03-13",
        "description": "Read Evan Rytlewski’s review of the album.",
        "authors": "Evan Rytlewski",
        "url": "https://pitchfork.com/reviews/albums/the-tubs-cotton-crown",
        "text": "Shortly before founding his jangle quartet the Tubs, Owen Williams poured himself into a very different passion project: a prickly novel inspired by the suicide of his mother, folk singer and writer Charlotte Greig. “It was 2016 and the Trauma Industrial Complex was revving into gear,” Williams explained in a Substack post; “I wanted to be exploited too.” Alas, he recounts, the market was not as ripe for his style of unsentimental grief as he’d anticipated. Every agent passed on the book, and he did not take the rejection well: “There’s a special kind of humiliation in failing to hawk your big tragedy.”\nThe light at the end of his spiral of sleepless, Xanax-addicted months came in part from the unexpected success of the Tubs, who were attracting interest beyond the niche corners that still get excited about a new jangle-pop album. After the warm reception to the band’s dourly tuneful 2023 debut Dead Meat, the idea nagged at Williams: Perhaps there might be a back door to repurpose a little bit of the novel that nobody wanted. He found that the songs for the Tubs’ follow-up Cotton Crown came quickly.\nCotton Crown doesn’t shy from the inherent discomfort of the subject matter. That’s the artist’s mother on the album cover, breastfeeding a newborn Williams in a graveyard in a black and white photo originally used for one of her 7\"s. The closing song, “Strange,” includes an anecdote about a stranger grabbing Williams’ arm at his mother’s wake and suggesting he could write a song about it, an origin story he appendixes with an apology (“Well, whoever the hell you are/I’m sorry, I guess this is it”). “The Thing Is” opens the record with the kind of self-loathing endemic of somebody who’s going through too much shit to be any good in a relationship.\nThe difference between a sad song and a sad novel, of course, is that given their in-and-out nature, sad songs aren’t nearly as suffocating—especially not the way the Tubs’ play them. In spite of Williams’ glum lyrics and cold, stricken voice, the music always chugs along merrily. “Freak Mode” barrels forward with the pep of Bob Mould at his most frolicksome, while the jubilant \"Narcissist\" rings out with Johnny Marr chime. Even Williams’ dispatches from the deepest throes of depression are played as absolute romps. “Somehow sitting in my empty room/Is the only thing I wanna do,” Williams sings on “Illusion” over rollicking pub rock.\nAs always, guitarist George Nicholls and backing vocalist Lan McArdle serve as the sugar and creamer to Williams’ black coffee. (McArdle, William’s past bandmate in Joanna Gruesome and present one in Ex-Vöid, isn’t a full member of the Tubs, yet their harmonies are so integral to the pleasure that it’s difficult to imagine their albums without them.) If Dead Meat played like a lost IRS Records release from 1987, Cotton Crown plays like one from 1988—a touch clearer, a touch more refined, perhaps, but fundamentally of a piece. The album’s improbable feat is that, even with its inherent tragedy, Cotton Crown is somehow an even breezier, more agreeable listen. It’s not often that sorrow goes down so easily.\nAll products featured on Pitchfork are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.",
        "image": "https://media.pitchfork.com/photos/67c85d423099199a150c4b7b/16:9/w_1280,c_limit/The-Tubs-Cotton-Crown.jpeg",
        "categories": [],
        "source": "pitchfork",
        "topic": "music",
        "estimatedReadingTime": 2
    },
    {
        "title": "TOKiMONSTA: Eternal Reverie",
        "created_at": "2025-03-12",
        "description": "Read James Gui’s review of the album.",
        "authors": "James Gui",
        "url": "https://pitchfork.com/reviews/albums/tokimonsta-eternal-reverie",
        "text": "Jennifer Lee has always risen to the challenge. Better known as TOKiMONSTA, Lee came up in the late-aughts L.A. beat scene, gaining cred for her smart sampling and adroit drum programming at Project Blowed and Low End Theory; she later became the first woman to be signed to FlyLo’s label Brainfeeder with 2011’s Creature Dreams. Lee’s beats were innovative, sometimes mixing the textures of Korean instruments with spaceship arpeggios. In 2015, a life-threatening brain disease temporarily robbed her of the ability to hear music, but once she recovered, she locked right back into producing. Then, just as she was ready to drop her latest album, Eternal Reverie, she took on full-time care duties for a beloved friend with terminal cancer, postponing the record’s release and tour until this year.\nIn recent years, Lee’s once futuristic, lumbering sound has moved toward a smoother strain of EDM-lite that’s more in keeping with ZHU or Elephante than J Dilla, leaning into the soporific side of her early bedroom productions even as she has sharpened her drops for the big stage. Eternal Reverie continues in the same direction, mostly replacing swung rhythms with four-on-the-floor house and disco beats, and conjuring hazy sunsets in swirls of synth and guitar. It’s pleasant, but rarely goes beyond the retail slickness that has characterized Lee’s recent work. Longtime collaborator Gavin Turek gives a tame vocal performance on “Lucky U,” competing with a ubiquitous “Think” break that has surgically removed James Brown’s characteristic yelp. Anderson .Paak proteges GAWD try to kick some life into “Switch It” with sultry triplets, but the restrained pace and telegraphed flow are more Dr. Seuss than Ice Spice. When they ask, “Why you so boring?” they might as well be addressing her programmatic snare rolls.\nEver the omnivorous listener, Lee brings in some global rhythms, though her grooves don’t feel as fresh as they used to. “Corazón / Death by Disco, Pt. 2,” the sequel to a track from her breakout album Midnight Menu, gives a Brazilian disco sample the filter-house treatment. But while older tracks like “Simple Reminder” defamiliarized Brazilian rhythms by infusing bossa nova beats with cosmic textures, “Corazón” merely sprinkles a tamborzão on top. “All In” looks to Afropiano for inspiration, with just enough silverware percs and shakers to give us a hint of Nigeria, but not much else.\nEternal Reverie blends into the background so easily, it’s hard to fathom that this is the same producer who once worked on a noise-ridden anti-nuclear protest song with Otomo Yoshihide and Ryuichi Sakamoto. But any iconoclastic spirit long since gave way to more crowd-pleasing instincts—a tendency that seemingly reached its telos with her recent forays into NFTs and a web3-driven streaming platform. It would be nice to hear a new record that returns to TOKiMONSTA’s more experimental roots.",
        "image": "https://media.pitchfork.com/photos/67c70f62f86dda6db15ae693/16:9/w_1280,c_limit/TOKiMONSTA:%20Eternal%20Reverie.jpg",
        "categories": [],
        "source": "pitchfork",
        "topic": "music",
        "estimatedReadingTime": 2
    },
    {
        "title": "Feeble Little Horse: “This Is Real”",
        "created_at": "2025-03-12",
        "description": "The Pittsburgh band’s first new song in two years puts a hyper-caffeinated, high-contrast spin on “pop-rock.”",
        "authors": "Holden Seidlitz",
        "url": "https://pitchfork.com/reviews/tracks/feeble-little-horse-this-is-real",
        "text": "Feeble Little Horse traffic in irony and contradiction. Their name bites its thumb at the waifish bedroom pop whose fragility their own music borrows and warps; singer Lydia Slocum’s Courtney Love bleach job and airy, disaffected voice make a cheeky contrast to the band’s jagged instrumentation. On their first two records, the Pittsburgh four-piece’s sludgy progressions evoked ’90s post-rock, but the hypermodern, computerized production hewed closer to contemporaries like They Are Gutting a Body of Water and Spirit of the Beehive. Their first single in two years, “This Is Real,” takes the juxtaposition between light and dark a step further, scavenging the Bandcamp archives of their feeble little peers and the sheen of hyperpop. If hyperpop and hardcore share some base resemblances—inhuman vocals (pitch-shifted roboticism, monstrous shrieks) and freneticism—then a group like Feeble Little Horse, fluent in both mock whimsy and heavier techniques, is perfectly poised to disrupt them.\nIn just three minutes, “This Is Real” flits between as many forms. When a broody bubblegum intro—featuring Slocum’s repetitive incantation about hotboxing a janky car and skittering samples that sound like video game bonuses—flips to an impenetrable wall of death metal distortion, the shock isn’t the difference so much as the similarity. The feelings carry over: overcaffeination and dissociation. 100 gecs on one side and Model/Actriz on the other have played with these boundaries before, but not with quite the same intensity. “If you’re not real, then I’m not real,” Slocum repeats hypnotically over a mounting riff, before she opens her throat and begins to scream. The group’s princess has clawed through her pleasantries.",
        "image": "https://media.pitchfork.com/photos/67d093f75b3f700a709d87e8/16:9/w_1280,c_limit/feeble%20little%20horse:%20%E2%80%9Dthis%20is%20real%E2%80%9D.jpg",
        "categories": [],
        "source": "pitchfork",
        "topic": "music",
        "estimatedReadingTime": 1
    },
    {
        "title": "Haim: “Relationships”",
        "created_at": "2025-03-12",
        "description": "The trio returns with a blissful slice of pop-funk devoted to the topic no one knows how to talk about.",
        "authors": "Anna Gaca",
        "url": "https://pitchfork.com/reviews/tracks/haim-relationships",
        "text": "What’s that sound? Is it the first song of the summer? Is it “Relationships,” the featherweight, angst-filled new Haim track about a tortured silence in a long-term romance? Is it both, or it could be, maybe, if we just—no, wait, don’t answer that. Produced by Danielle Haim and Rostam, with single cover art inspired (with plausible deniability) by Nicole Kidman’s (plausibly denied) divorce paparazzi shot, the not-at-all-deep “Relationships” still somehow manages to encapsulate the problem with modern relationships: We don’t know how to talk about them at all. A head-clearing drum intro leaves our narrator alone with her thoughts, wondering whether all this heartache is something we should’ve outgrown (“Is it just the shit our parents did?”), or if we’re still too young to understand (“Maybe that’s just how it goes/When you’re not fully grown”), whether great loves “end up all the same” or if she’d “do it all it again” (well, yes). The summery minimal funk continues apace, the logic circling like a song on repeat, the resolution never quite satisfying. “Relationships” is cagey like that—like you could send it to your crush and they couldn’t begin to know what you really meant.\nGenre:\nRock\nLabel:\nColumbia\nReviewed:\nMarch 12, 2025\nThe trio returns with a blissful slice of pop-funk devoted to the topic no one knows how to talk about.",
        "image": "https://media.pitchfork.com/photos/67d1b5d023a109932cd061b4/16:9/w_1280,c_limit/Haim-Relationships.jpeg",
        "categories": [],
        "source": "pitchfork",
        "topic": "music",
        "estimatedReadingTime": 1
    },
    {
        "title": "Crazy for Cozy: The New Vanguard of ASMR",
        "created_at": "2025-03-12",
        "description": "Rabbit Holed is Kieran Press-Reynolds’ weekly column exploring songs and scenes at the intersection of music and digital culture, separating shitpost genius from shitpassé lameness. This week, Kieran tests their tingle tolerance, exploring the outer reaches of experimental ASMR.",
        "authors": "Kieran Press-Reynolds",
        "url": "https://pitchfork.com/thepitch/crazy-for-cozy-the-new-vanguard-of-asmr",
        "text": "ASMR is something you either get—and fall deep down the rabbit hole—or stay the hell away from. I remember discovering ASMR accidentally around 2014, when I was trying to massage my aching foot after a punishing afternoon of track practice; I stumbled on a “reflexology” video whose narration and background music were so oddly relaxing that it kept me coming back even when I wasn’t in pain. Over the years, I got so into watching ASMR to unwind that I forced myself to quit because I thought I was addicted.\nFor the uninitiated, ASMR stands for “Autonomous Sensory Meridian Response,” and it refers to a subjective phenomenon where people report feeling “tingles,” or a kind of warm current running down their spine, neck, or head in response to audiovisual stimuli such as tapping wooden blocks or squishing slime. It’s like a jacuzzi for the jaded, exhausted mind.\nThe content genre kicked off on forums and YouTube in the early 2010s and went mainstream by the end of the decade. Suddenly, there were ASMR superbowl ads, news reports, a 21 Savage song called “asmr” where the rapper whispers softly over a menacing Metro Boomin beat, and ASMR YouTubers (ASMRtists) with millions of subscribers. It’s hard to believe that the video style hasn’t been totally exhausted of ideas and converted into a soulless influencer content farm. Returning to watch videos this year, what’s shocked me the most is how weird, extreme, and tingly the content is.\nFor the vanilla relaxers, there’s still tons of entry-level ASMRtistry being made: the soap carvers, the gentle whisperers, the cranial nerve exam roleplayers. But for the real heads, the tingle trench vets who now suffer from tingle immunity—the term for when you listen too much and develop a tolerance to basic ASMR methods, requiring “harder” ASMR substances—there’s been something like a nuclear tingles race for mutually assured relaxation. A slew of new metas has emerged, from spit-painting to “overexplaining simple things” to the “Giving You a Black Market Lobotomy” roleplay craze. The titles beg you to click: Deep Cerebral Penetration. ASMR 8D to 32D! 200% Sensitive Deep Whisper You Can FEEL in Your Ears. There are types of clips I couldn’t even have imagined half a decade ago, like ASMR that’s basically avant-garde breath play and videos so frantic they’re more like anguish-inducing anti-ASMR.\nNothing turns my brain into a quivering fuzzball faster than “Fast & Aggressive,” the ASMR equivalent of nightcore music. Flooded with jittery whispers and kinetic hand movements flying everywhere, these videos feel like you’re participating in a yoga session at 2x speed. I remember YouTuber seb ASMR’s “FASTEST 1 MIN ASMR EVER” felt blistering, game-changing when he dropped it back in 2018; nowadays, the unhinged aural assaults by speedrun-soothers like Blissful Zen ASMR and Miss Manganese make his attempt feel sedate. Creators will tell you to look at certain areas of the screen or do mental math in an instant; Rebecca ASMR often whirls multiple items at once while asking you to switch your focus between them every half-second like you’re performing a hand-eye coordination test. Some videos are so aggro they advertise “slamming” and “banging” in the title to tantalize people. There is indeed even a type of ASMR where creators simulate stabbing you and beating you until you faint. The line between relaxation-core and Merzbow is fading fast.\nTo take it to the next level, ASMRtists will simulate a stutter, so their words hit your ears in frenetic and enticingly jagged patterns. The canniest creators maximize the effect by combining rapidfire stutters with “breathy whispers” and an anticipatory trigger like almost saying something but then freezing in place, so it’s hard to predict when they’ll make the noise and they keep you in a kind of stupor-suspension. Creators then layer the vocal mayhem with finger snaps and visual movement to create a mosaic of calming chaos. They’ll even use specific phrases, like “stipple” or “nape of the neck,” that glide off the tongue.\nThe breathy-stutter GOAT might be ASMR Ceri, whose videos verge on straight-up hyperventilation. There’s something almost terrifying about the way her voice leaps up and then suddenly stops—it feels like I’m in the backyard of Queens nightclub Nowadays coaching my friend out of a K-hole. In one recent video, she said the technique was so taxing to perform that it made her lungs sore. “I get exhausted to the point of like, it makes you feel nauseous because you’re s-s-s-so short, so short of breath short of breath short of breath,” she said while gasping and stretching her voice. In the comments, people say she gives them tingles like nobody else.\nThe innovations go beyond the vocal frontier. The visual mischief on the channel Patrick’s ASMR makes you feel either snoozy or seasick—see a clip where he simulates you (the camera) riding a swing in a train yard, rocking the screen up and down in an arc. People have gone berserk with green screens, like SkepticalPickle’s hallucinatory haze of a video where her nails and makeup morph into neon cyclones and every sound drips with reverb. One of my favorite recent finds is a Korean-language creator sprinting between the left and right channels of the mic, landing critical-hits on your ears by tickling both sides in a mad volley. “I'm tingle immune and this was the first thing to give me those heavy tingles,” one commenter praised. “I’m talking full back spasms.”\nThe amount of elaborate ASMR roleplays now is astonishing. An entire niche revolves around people acting like your “bitchy friend” and verbally abusing you; on the flipside, there’s “Thicc Himbo Whispers Sweet Nothings In Your Ear.” At the weirder end, you’ll find hyperspecific period pieces: Imagine it’s 1663 and you’re the kitchen hand for a cook who’s been ordered to bake an apple pie. Imagine it’s the 1300s and a nun tends to you as you convalesce with the Black Plague. There’s also Angelica’s “Your Period Finds Out You’re A Lesbian” and “6 Wives of Henry VIII Confide in You” and Ephemeral Rift dressed in a baleful alien costume interrogating you. If that’s not strange enough, there’s also ASMR vore, a supposedly soothing variant of the paraphilia that involves wanting to eat or be eaten by another creature. Hundreds of thousands of fans have flocked to YouTube clips offering “Full Vore Tours,” which means stomach growling and “intestine ambience” that makes you feel like you’re nestled in a warm belly.\nIn terms of pure spectacle, barely anyone can compete with ATMOSPHERE. She’s developed an entire “Atmosverse” of lore around Medieval and Gothic worlds, with a roster of fictional characters including us, the viewers, playing a protagonist called the Sleepwalker. The channel’s solo creator, Anastasia, told me she came to ASMR from a background studying cinematography, psychology, and stage production. She uses Adobe After Effects, Audacity, even Unreal Engine to sculpt intricate sets and constantly shifting background visuals. In “Ladies of the Twilight Theatre,” the 67th video of her ongoing series, you’re whisked around fog-filled courtyards and shadowy hallways, following women who make cryptic warnings about how we’re “burning.”\nShe speaks about her videos like they’re part of a grander conceptual vision, referencing the theatrical technique à part (when a character speaks directly to the audience, which she sees as analogous to ASMR roleplays) and how she’s fascinated by the divide between realism and symbolism. “The level of immersion that ASMR offers adds an even more personal touch for each viewer—as if they are journeying through this world alongside my characters,” she says. Her predictions about how ASMR will develop as a genre read like wall text for a post-internet exhibition: “I see it as the opening chords of a much larger symphony of the future. It’s only beginning to be explored, along with the science of mirror neurons.” This is ASMR as high art—and Anastasia might be the only director that actually wants you to fall asleep to her films. She believes the next vanguard of experimental ASMRtists will rewire the scene with VR.\nFrom afar, it’s hard to imagine how ASMR is a “form” you can push forward in a meaningful way. After all, it’s so easy to distill it into a bland formula of binaural 3Dio-brand mic plus mouth sounds. Dive deeper and you’ll encounter so many oddballs going out on a limb just trying weird shit, which then filters into other creators’ styles. The coolest thing about ASMR is how it operates like a network of isolated experiments—creators picking up on other ASMRtists’ trigger-inventions and using it in their own routines, working together to concoct an audiovisual folk tradition. At best, it reminds me of the way music evolves: little mutations that artists discover—vocal tics, drum patterns, playful Auto-Tune misuse—and collectively push forward, forming an ecosystem of incremental advances. This is what Brian Eno described as “scenius,” or the way collective clusters can make larger leaps than any singular genius. Rather than Jersey club triplets or shoegaze tremolo, this is a language of sk-sk noises and nail scrapes, of Kelly Belly “wave crash” and RaffyTaphy “setting and breaking the pattern” triggers.\nASMR is an inherently cringe pastime—both creating it and admitting you spend time before bed worshiping some disembodied face whimsically waving their hands on the screen. But at the heart of it is an army of armchair scientists tapping into the unknown, shattering relaxation boundaries and spewing gibberish all in the hopes that someone out there will tingle.\nWhat I’m listening to:",
        "image": "https://media.pitchfork.com/photos/67d04cc8b3a6fe6b02befe5d/16:9/w_1280,c_limit/P4K25_RabbitHoled_2x1.png",
        "categories": [
            "columns"
        ],
        "source": "pitchfork",
        "topic": "music",
        "estimatedReadingTime": 7
    }
]