[
    {
        "title": "‘Wicked,’ ‘Emilia Perez,’ ‘What We Do in the Shadows’ Among ACE Eddie Winners",
        "created_at": "2025-03-15",
        "description": "'Wicked,' 'Emilia Perez,' 'The Wild Robot,' 'What We Do in the Shadows' Among ACE Eddie Winners",
        "authors": "Carolyn Giardina",
        "url": "https://variety.com/2025/artisans/news/ace-eddie-awards-2025-winners-list-1236334670/",
        "text": "“Emilia Perez” and “Wicked” won the live action feature categories at the 75th ACE Eddie Awards, were handed out Friday night at UCLA’s Royce Hall. The event was originally slated to be held on Jan, 18 but was postponed due to the L.A. fires. In response to the fires, the event also pivoted to a heartfelt fundraising event with a “come as you are” dress code.\nJuliette Welfling won the best edited dramatic feature category for “Emilia Pérez” and Myron Kerstein claimed the best edited comedic feature award for “Wicked.” Accepting the award, Kerstein thanked “Wicked” director Jon M. Chu–who received Golden Eddie during the ceremony–saying “you’ve changed my life for the better and restored my hope for both the world and for cinema.”\nMary Blee won the animated feature Eddie, for “The Wild Robot;” and Monique Zavistovski collected the feature documentary prize for “Will & Harper.”\nPopular on Variety\nWinners in the episodic categories included Maria Gonzales and Aika Miyake for “Shogun,” Liza Cardinale and Dane McMaster for “What We Do in the Shadows,” and Peter H. Oliver and Benjamin Gerstein for “Baby Reindeer.”\nAccepting the Golden Eddie to a standing ovation, Chu called editors and all on the editing teams “great interpreters, able to deliver feelings through pictures that can change lives and change culture … no other medium in the world can do in a weekend when your work in a movie theater can.”\nHe continued that “when it all comes together, it’s like it was always supposed to be there. So much so people forget that it was even edited. The public thinks this is the way it always was. But you know, the director knows.” And getting a big laugh, he added, “sometimes the studio knows, the actors definitely don’t know.”\nHe also saluted his “Wicked” editor, calling Kerstein his “cinema soul mate”\nMaysie Hoy (“McCabe & Mrs. Miller”) and Paul Hirsch (“Star Wars”) received standing ovations as they accepted Career Achievement Awards.\nHirsch saluted ACE “which has worked hard for 75 years to advance the prestige and dignity of the editing profession, promoting respect for what we do and who we are. We are artists.” With a nod to George Lucas’ “Star Wars,” he said, “Thank you George for the ride of my life.”\nHoy remembered the “resilience and bravery” of her family as they came to the U.S., adding “I humbly accept this extraordinary award on behalf of all the dreamers out there.”\nDuring the evening the Anne V. Coates Student Editing Award was presented to Hannah Hallock of Brooklyn College.\nThe full list of winners follows:\nBEST EDITED FEATURE FILM (Drama, Theatrical)\n“Civil War” – Jake Roberts, ACE\n“Conclave” – Nick Emerson\n“Dune: Part 2” – Joe Walker, ACE\nWINNER “Emilia Perez” – Juliette Welfling\n“Furiosa: A Mad Max Saga” – Eliot Knapman, Margaret Sixel, ACE\nBEST EDITED FEATURE FILM (Comedy, Theatrical)\n“Anora” – Sean Baker\n“Challengers” – Marco Costa\n“A Real Pain” – Robert Nassau\n“The Substance” – Coralie Fargeat, Jérôme Eltabet, Valentin Féron\nWINNER “Wicked” – Myron Kerstein, ACE\nBEST EDITED ANIMATED FEATURE FILM\n“Flow” – Gints Zilbalodis\n“Inside Out 2” – Maurissa Horwitz\n“Moana 2” – Jeremy Milton, ACE, Michael Louis Hill\n“Wallace & Gromit: Vengeance Most Fowl” – Dan Hembery\nWINNER “The Wild Robot” – Mary Blee\nBEST EDITED DOCUMENTARY (Theatrical)\n“Beatles ’64” – Mariah Rehmet, ACE\n“Jim Henson Idea Man” – Sierra Neal, Paul Crowder, ACE\n“Her Name was Moviola” – Howard Berry\n“Super/Man: The Christopher Reeve Story” – Otto Burnham\nWINNER “Will & Harper” – Monique Zavistovski, ACE\nBEST EDITED DOCUMENTARY SERIES\nWINNER “Chimp Crazy” (102 – Gone Ape) – Evan Wise, ACE, Charles Divak, ACE, Adrienne Gits, ACE, Doug Abel, ACE\n“The Jinx – Part Two” (203 – Saving My Tears Until It’s Official) – Richard Hankin, ACE, Charles Olivier\n“Quiet On Set: The Dark Side of Kids TV” (102 – Hidden in Plain Sight)” – Daphne Gómez-Mena, Jane Jo, ACE\n“STEVE! (Martin) a Documentary in 2 Pieces” (101 – Then) – Alan Lowe\n“STEVE! (Martin) a Documentary in 2 Pieces” (102 – Now) – Jeff Malmberg, ACE, Aaron I. Naar\nBEST EDITED MULTI-CAMERA COMEDY SERIES\nWINNER “Frasier” (207 – My Brilliant Sister) – Russell Griffin, ACE\n“Poppa’s House (102 – Sleepover)” – Angel Gamboa Bryant, ACE\n“The Upshaws” (506 – Do I)- Angel Gamboa Bryant, ACE, Brian LeCoz\nBEST EDITED SINGLE CAMERA COMEDY SERIES\n“The Bear” (301 – Tomorrow) – Joanna Naugle, ACE\n“Curb Your Enthusiasm” (1206 – The Gettysburg Address) – Steven Rasch, ACE\n“Nobody Wants This” (101 – Pilot)” – Maura Corey, ACE\n“Only Murders in the Building” (410 – My Best Friend’s Wedding) – Shelly Westerman, ACE, Payton Koch\nWINNER “What We Do in the Shadows” (603 – Sleep Hypnosis)- Liza Cardinale, ACE, Dane McMaster, ACE\nBEST EDITED DRAMA SERIES\n“3 Body Problem” (105 – Judgment Day) – Michael Ruscio, ACE\n“Fallout” (101 – The End) – Ali Comperchio\n“Mr. & Mrs. Smith” (101 – First Date)”- Kyle Reiter, ACE, Isaac Hagy, ACE\nWINNER “Shogun” (110 – A Dream of A Dream) – Maria Gonzales, ACE, Aika Miyake\n“Slow Horses” (401 – Identity Theft)”- Robert Frost\nBEST EDITED FEATURE FILM (NON-THEATRICAL)\n“Am I OK?” – Kayla M. Emter, ACE, Glen Scantlebury, ACE\nWINNER “Road House” – Doc Crotzer, ACE\n“Unfrosted” – Evan Henke, ACE\nBEST EDITED LIMITED SERIES\nWINNER “Baby Reindeer” (104 – Episode 4) – Peter H. Oliver, Benjamin Gerstein\n“Disclaimer” (105 – V) – Adam Gough, ACE, BFE\n“Fargo” (510 – Bisquik) – Regis Kimble\n““The Penguin” (101 – After Hours) – Henk van Eeghen, ACE\n““Ripley” (105 – V Lucio) – Joshua Raymond Lee, David O. Rogers\nBEST EDITED NON-SCRIPTED SERIES\n“Conan O’Brien Must Go” (104 – Ireland) – Matthew Shaw, Brad Roelandt\n“Couples Therapy” (401) – Ryan Loeffler, Eileen Meyer\nWINNER “Welcome to Wrexham” (305 – Temporary) – Tim Wilsbach, ACE, Steve Welch, ACE, Michael Brown, Michael Oliver, Tim Roche, Matt Wafaie, Jenny Krochmal\nBEST EDITED VARIETY TALK/SKETCH SHOW OR SPECIAL EVENT\n“Ali Wong: Single Lady” – Sean Hubbert\n“John Mulaney Presents: Everybody’s in L.A.” (104 – Paranormal) – Kelly Lyon, ACE, Sean McIlraith, Ryan McIlraith\nWINNER “Last Week Tonight with John Oliver” (1103 – Boeing) – Anthony Miale, ACE\nBEST EDITED ANIMATED SERIES\n“Bob’s Burgers” (1413 – Butt, Sweat, and Fears) – Stephanie Earley, ACE, Jeremy Reuben, ACE\n“The Simpsons” (3514 – Night of the Living Wage) – Don Barrozo\nWINNER “X-Men ’97” (105 – Remember It) – Michelle McMillan",
        "image": "https://variety.com/wp-content/uploads/2025/02/2551_D133_00142R.jpg?crop=0px%2C19px%2C6361px%2C3578px&resize=1000%2C563",
        "categories": [],
        "source": "variety",
        "topic": "entertainment",
        "estimatedReadingTime": 5
    },
    {
        "title": "Box Office: ‘Novocaine’ Leading ‘Black Bag’ and ‘Mickey 17’ in Close Race for First as Theaters Potentially Face the Slowest Weekend of 2025",
        "created_at": "2025-03-15",
        "description": "Jack Quaid's 'Novocaine' is beating 'Mickey 17' and Steven Soderbergh's 'Black Bag,' but the box office could turn in its slowest weekend for 2025.",
        "authors": "J Kim Murphy",
        "url": "https://variety.com/2025/film/box-office/box-office-novocaine-opening-day-mickey-17-1236338166/",
        "text": "Movie theaters haven’t exactly been bustling since the start of 2025 and the calendar year is about to turn in one of its most meagre frames yet. Even with two new wide releases — Paramount’s slapstick beat-em-up “Novocaine” and Focus Features’ spy film “Black Bag” — exhibitors are in danger of a particularly beleaguered weekend, one that will likely see no feature grossing in the eight digits.\nThat hasn’t happened since February 2024, when Apple’s hopeful franchise starter “Argylle” crumbled in its second weekend. Whether or not any individual releases can get north of $10 million, the overall outlook remains dreary. The Feb. 7 Super Bowl weekend remains the lowest-grossing of 2025 in North America, when “Dog Man” led charts with $13 million and all releases totaled $55.8 million. This weekend seems likely to sink lower.\n“Novocaine” has the edge for No. 1 for now, though “Black Bag” and last week’s “Mickey 17” aren’t far behind. The action-comedy, which is directed by Dan Berk and Robert Olsen and stars Jack Quaid as a banker-turned-vigilante unable to feel pain, earned $3.9 million across Friday and preview screenings from 3,365 locations and is eyeing an $8.5 million debut. Projections for a $10 million opening now seem beyond reach, though Saturday grosses will better indicate momentum.\nPopular on Variety\nAt an $18 million production budget, the R-rated “Novocaine” wasn’t a colossal investment for Paramount. Positive reviews could portend a sustained theatrical run, but moviegoer pollster Cinema Score turned in a mixed “B” grade among ticketbuyers.\nMeanwhile, Universal’s specialty label Focus is looking at third place with “Black Bag,” an R-rated thriller of marital and geopolitical espionage. Director Steven Soderbergh’s star-packed film, which features names like Cate Blanchett, Michael Fassbender and Pierce Brosnan, earned $2.8 million across Friday and previews from 2,705 theaters. The film cost $50 million to produce — hefty for Focus — and the hope will be that it can multiply well and be an overseas draw. Soderbergh has always drawn critical support, though “Black Bag” has received some of the filmmaker’s best reviews. Cinema Score is at a cooler “B” grade.\nAfter getting No. 1 in its opening last weekend, Warner Bros.’ “Mickey 17” is expected to slide to second place, earning $2.2 million on Friday. Rivals are projecting a 60% drop this weekend for director Bong Joon Ho’s interplanetary comedy, now looking to cross $33 million in its first 10 days of release — a disappointing return on what was a $118 million production. With global sales lagging too, the film won’t be able to reach profitability in theaters.\nDisney’s “Captain America: Brave New World” is eyeing fourth place after earning another $1.5 million on Friday for a $181.4 million domestic total. Winding down its theatrical run in its fifth weekend of release, the comic book film is now passing “Ant-Man” ($180 million), “Thor” ($181 million) and “Black Widow” ($183 million) among Marvel Cinematic Universe entries. With “Thor: The Dark World” ($206 million) likely out of reach, that means “Brave New World” will finish as one of the lowest-grossing MCU installments, ranking at 28th out of 35. Marvel will hope to bounce back in the summer with “Thunderbolts*” and “The Fantastic Four: First Steps.”\nAlso opening this weekend, Ketchup Entertainment and Falling Forward Entertainment should round out the top five with “The Day the Earth Blew Up: A Looney Tunes Movie” in 2,827 theaters. The animated title was originally produced for Warner Bros. Discovery’s now-retitled streaming service HBO Max, but was shopped to buyers in 2022 amid the company’s restructuring. The Ketchup release earned about $1 million on Friday and will hope to cross $3 million in its debut. Reviews are positive and Cinema Score is at a “B+.”\n“The Last Supper” — not to be confused with Fathom Events’ upcoming April release of “The Chosen: Last Supper” (a multi-week theatrical rollout of Season 5 of 5&2 Studios’ biblical television series) — could crash the top five, playing in 1,575 locations. Released by Pinnacle Peaks Pictures, the film earned about $1 million on opening day. Cinema Score graded at an “A-.”\nA24 is bowing “Opus,” a kooky horror send-up of celebrity cults starring Ayo Edebiri, in 1,764 theaters. It earned about $420,000 on Friday and will have to push to cross $1 million in its opening. The film received negative reviews out of its Sundance premiere — hardly the warm critical response A24 is accustomed to — and the middling “C+” grade on Cinema Score indicates general audiences aren’t sweetening the reputation either. Costs are lean for “Opus” at a production budget under $10 million.",
        "image": "https://variety.com/wp-content/uploads/2025/03/novocaine-mickey-black-split.jpg?crop=0px%2C0px%2C999px%2C562px&resize=1000%2C563",
        "categories": [],
        "source": "variety",
        "topic": "entertainment",
        "estimatedReadingTime": 3
    },
    {
        "title": "‘Super Paradise’ Follows Mykonos’ Path From Hippie Paradise to Party Island and Billionaires’ Playground",
        "created_at": "2025-03-15",
        "description": "Steve Krikris' documentary traces the transformation of Mykonos from a hippie paradise to a notorious party island and billionaires' playground.",
        "authors": "Christopher Vourlias",
        "url": "https://variety.com/2025/film/global/super-paradise-golden-age-mykonos-1236338295/",
        "text": "In one of the many eye-opening moments in “Super Paradise,” Greek filmmaker Steve Krikris’ loving documentary portrait of the island of Mykonos, Marilli Tsopanelli, a writer and multi-disciplinary teacher of mime and dance, recalls the bohemian, free-loving spirit that prevailed on the island in the 1960s and ’70s. “Most of my friends lost their virginity in 1971,” Tsopanelli explains. Another interview subject puts it more bluntly: “So much sex.”\nIt would be inaccurate to characterize Krikris’ documentary as a lusty romp through the hedonistic heyday of “a scandalous place,” as another of the film’s talking heads describes it; indeed, the director, who spent summers on Mykonos throughout his youth, thoughtfully traces the island’s journey from an impoverished fishing community during the Second World War through its golden age as a hippie enclave in the ’70s, continuing onward to the velvet-roped excesses of today.\n“Super Paradise,” which premieres this week in the Newcomers competition of the Thessaloniki Intl. Documentary Festival, is the first documentary from Krikris, whose deadpan drama, “The Waiter,” premiered at Thessaloniki’s sister event in 2018. Based on an original idea by Paul Typaldos, who shares producing credits with Dafni Kalafati, it’s an emotional return to one of the defining places of the filmmaker’s adolescence, the site of endless summers that also marked an “important milestone” by setting him on a course to make movies.\nPopular on Variety\nIt was in Mykonos that Krikris, who was born in the U.S. but moved to Greece around the age of 5, befriended a San Francisco gallerist who invited him to the Bay Area; there he was introduced to the San Francisco Art Institute, where he would go on to study film. “Everything started from Mykonos,” Krikris explains.\n“Super Paradise” — which takes its name from one of the island’s iconic beaches — charts nearly a century in the island’s development, but it lingers longingly on the golden years when Krikris and his Athens pals would pitch up with just a thousand drachmas — the equivalent of a few bucks today — and spend several weeks camped out under the stars, unfurling their sleeping bags on empty beaches or on the terraces of welcoming locals.\n“It was the era, it was the music, it was the people, it was the place,” Krikris says. “Everybody was the same. There were no bouncers, there were no limousines. Everybody was mingling. You would see the Mykonian fishermen, you see the hippies and the VIPs and all these fashion designers sitting at the same table. Everybody was together.”\nThat care-free spirit, as the film illustrates, hardly existed in a vacuum, emerging in part as a defiant response to darkening times. In the ’70s, as Mykonos was being discovered by the free-loving hippies who landed it on the map, Greeks elsewhere were living under the iron fist of a military dictatorship. Homosexuality, though freely expressed — and celebrated — on the island, was illegal. Elsewhere the U.S. was fighting a bloody and unpopular war in Vietnam, while military regimes were seizing power across Latin America. It was against that backdrop that Mykonos “emerged as a beacon of hope, freedom and self-expression,” as one of the film’s subjects notes.\nBy the time Krikris aged into young adulthood, that bohemian ethos had begun to fade. Moneyed interests came pouring in to cater to globe-trotting, jet-setting elites, while Mykonos was increasingly “starting to become a brand name.” “It wasn’t for me anymore,” says the director, who avoided the island for years for fear that he would “ruin it by going back.”\nIn the end, Krikris and his team returned to Mykonos more than a half-dozen times across four years to make “Super Paradise.” He accumulated roughly 100 hours of material, including interviews with many of the men and women who were part of the swinging scene of the ’70s, as well as Super 8 reenactments and archival material Krikris sourced with the help of Canadian archival producer Judy Ruzylo. Alongside editor Marios Kleftakis, he spent nearly 2 1/2 years bringing “Super Paradise” to the screen.\nThe resulting film not only charts the remarkable transformation of Mykonos but suggests it’s hardly an outlier, a victim of the same forces of global tourism that have reshaped destinations like Bali, Ibiza and Cancun. Citing Nietzsche, the Greek writer and philosopher Yiorgos Veltsos says “tourism is a leper,” and to back that up, there are no shortage of talking heads in “Super Paradise” to testify that today’s Mykonos is “a supermarket,” “the Wall Street of Greece,” and “a degrading replica of the past.”\nKrikris, however, is among those who still describe it as “a special place.” Or, as another local sage puts it: “It used to be a fishing island. Now, the boats are bigger. But life goes on.”\nThe Thessaloniki Intl. Documentary Festival runs March 6 – 16.",
        "image": "https://variety.com/wp-content/uploads/2025/03/MixCollage-15-Mar-2025-11-25-AM-5616.jpg?w=1000&h=563&crop=1",
        "categories": [],
        "source": "variety",
        "topic": "entertainment",
        "estimatedReadingTime": 4
    },
    {
        "title": "‘The Treasure Hunter’ Filmmaker on Following His Friend Into the Heart of Darkness: ‘Many Times I Put the Camera Down, and Hugged Him’ (EXCLUSIVE)",
        "created_at": "2025-03-15",
        "description": "Giacomo Gex’s “The Treasure Hunter” follows the director’s best friend, Jack, as he searches for treasure in the Philippines.",
        "authors": "Leo Barraclough",
        "url": "https://variety.com/2025/film/global/the-treasure-hunter-thessaloniki-documentary-festival-1236338327/",
        "text": "Giacomo Gex’s “The Treasure Hunter,” which had its world premiere this week in the Newcomers Competition at Thessaloniki Documentary Festival, follows the director’s best friend, Jack, as he searches for treasure in the Philippines. It’s a tale reminiscent of Werner Herzog’s “Fitzcarraldo.” Variety debuts the trailer here.\nAccording to local legend, during World War II the Japanese Army took booty they had looted from across South-East Asia to the Philippines and buried it at various locations. Jack, funded by his father, decided to join the many treasure hunters on the archipelago. “The Treasure Hunter” follows Jack as he plows millions of dollars into this quixotic search, digging at various sites, based on local rumors.\nAlthough many of the scenes in the jungle were shot underground in caves and in shafts dug in the hope they would lead to caves, Gex didn’t suffer from claustrophobia. The dangers were real enough, but the filmmaker’s focus on getting the shots he needed drove him on.\nPopular on Variety\n“I am not someone who’s filmed in warzones or extreme conditions, but I have been in potentially dangerous situations,” Gex tells Variety, sitting on the quay in Thessaloniki, a Greek port city overlooking the Aegean Sea. “One of my first short films was about a repossession agent in Los Angeles, and he would bring me with him to very dangerous areas in L.A., and would tell me not to get out of the car, but I knew that for the shot and for the film, I had to get out of the car, and I had to be with him, and I felt very unsafe.\n“Often, when I’m behind the camera, I will forget about the realities around me and forget about the dangers, because I will have this illusion that I’m safe behind the camera because I’m so focused on the shot and so focused on capturing the scene and framing the shot so that I can get the scene that I need and get the coverage that I need, that all sense of danger can disappear, and I had this same sensation in the jungle.\n“When we went into the caves and underground, there were very brief moments where I would cut the camera and suddenly realize I was 10 meters underground, lying on my belly on the floor in this cave that I couldn’t even sit up in, feeling the dampness and remembering that there are snakes in the Philippines. The king cobra is a very common snake there, and it’s very dangerous. A lot of the locals carry around charcoal tablets so that if you get bitten, you eat these, and it absorbs the poison from your bloodstream.\n“I was very aware that that was a threat so in those brief moments, I remembered that, yes, there could be a snake nest in there, and because they’re digging, they could aggravate it and threaten the children of the mother snake, and it could attack us. But I would say even more dangerous than that is the potential that the cave collapses because you’re fiddling around with it and you’re knocking about on the rocks, and none of this has a structure. It’s just purely natural. And a lot of those caves were left over from earthquakes, so they were not necessarily solid. And so, yes, there were dangers like that, but then I would go behind the camera again and forget about that, and then I would be okay.”\nJack’s hunt for the treasure is seen as compulsive, almost an addiction, which triggered conflicting emotions in the filmmaker. “As his friend, many times I put the camera down, and hugged him. But in many moments, I wanted to put the camera down, but I couldn’t, because I knew that I had to film what was happening and let it unfold. That’s the very tricky thing as a documentary filmmaker – you’re constantly battling with the ethics of it. But I felt it my duty to capture the consequences of addiction and what it can do to him and everyone around him. I felt it important to show that, and yes, I did tell him many times to stop, and I also told him that he should seek counselling.”\nJack’s obsessive search, and Gex’s determination to capture it, brings to mind Herzog’s “Fitzcarraldo,” and Gex acknowledges that Herzog was an early influence on him as a filmmaker.\n“There was something about his main character, but more about the soul and spirit of Herzog in that film that penetrated me in a strong way. I feel like I absorbed that, and it was definitely a subconscious influence. I never tried to copy it or emulate it in any way, but there was something that Herzog did with the jungle and Fitzcarraldo himself. And there was something about this quest of the impossible that was almost futile and almost for nothing … well, for us, for nothing, but for the character everything. And there was that similarity that I realized with Jack.\n“Whenever I am struggling and I feel sorry for myself during any part of the process, I always remember that Herzog pulled a real-life steam-boat over a mountain. If he could do that, I could probably do anything.”\nIt was when Gex spoke to Jack’s father in London that the idea of a film based on this search began to take shape. “I started talking to his father with cigarette smoke rising up in the shadows, and this voice with a gravitas to it, and suddenly I saw this image of him in front of the camera,” Gex says. “I hadn’t started filming him yet, but he was telling me about the story and I saw there was something about him that was extremely compelling, and even deeper than Jack, because he’s obviously an older man, and he brought a far greater seriousness to it, because there’s one thing – a young guy running around the jungle because he’s passionate about treasure – and another thing is this middle-aged, or more than middle-aged man, with an entire family, who’s putting his life on the line and taking big economical risks for this treasure. And it was at that stage where I was like, ‘This isn’t just a little film running around the jungle following my friend. This is more than that, and I have to have him on camera.”\nJack’s father hated being filmed and didn’t want to be interviewed, but Gex managed to get a four-hour long interview with him, but he didn’t get anything else. “He didn’t ever want to be interviewed again, even though I tried and tried and tried and tried.” Finally, when Jack’s father moved to Mexico, Gex decided to turn up on his doorstep to get an interview with him, but two weeks before he was supposed to go to Mexico, he got a call from Jack to say his father had died.\n“It was at that stage when I realized that that was the film’s ending. I didn’t know what the ending would be for many years, and a lot of people told me I was crazy and that if you don’t have an ending, you don’t have a film. There is no film if you go on forever with him just searching. People would get tired of just watching him search. But when his father passed away, I had this instinct that the circle was closed.”\nDespite the tragedy of the death, Gex sees it as having a positive side. “It was not just a sad, negative ending, because it was, in a way, cathartic for Jack. It was like this weight that was lifted off him, and obviously it was very sad, but I think he became much more his own self and his own man. He was more of an independent human being, and freer. It was what I saw as a friend.”",
        "image": "https://variety.com/wp-content/uploads/2025/03/The-Treasure-Hunter-002.jpg?w=1000&h=563&crop=1",
        "categories": [],
        "source": "variety",
        "topic": "entertainment",
        "estimatedReadingTime": 6
    },
    {
        "title": "Lee Kang-sheng Sets Two More Installments of Tsai Ming-liang’s ‘Walker’ Series (EXCLUSIVE)",
        "created_at": "2025-03-15",
        "description": "Taiwanese actor Lee Kang-sheng is set to reprise his role in the next two films of auteur Tsai Ming-liang's celebrated 'Walker' series.",
        "authors": "Naman Ramachandran",
        "url": "https://variety.com/2025/film/news/lee-kang-sheng-tsai-ming-liang-walker-series-1236338261/",
        "text": "Taiwanese actor Lee Kang-sheng is set to reprise his role in the next two films of auteur Tsai Ming-liang‘s celebrated “Walker” series.\n“Director Tsai is making two films in the Walker series soon. So I’ll be doing those,” Lee confirms to Variety, adding to his decades-long collaboration with the Malaysian-born Taiwanese director that began in 1989. Currently earning acclaim for his supporting role in Yeo Siew Hua’s surveillance thriller “Stranger Eyes,” which premiered at the Venice Film Festival, and for which he is nominated in the supporting actor category at the Asian Film Awards in Hong Kong, Lee discussed how his longstanding partnership with Tsai has influenced his approach to other projects.\n“There’s a lot of influence, because director Tsai isn’t a director who works with a full script. He often gives me a synopsis, so there’s a lot of room for improvisation,” Lee explains. “Director Tsai doesn’t like to yell ‘cut’ right away… I’m still acting. And once I finish what I have to do, I kind of have to figure out what to do next. It really gave me training for improvisation.”\nPopular on Variety\nThis improvisational style carried over to “Stranger Eyes,” where Lee convinced director Yeo, “a fan of Tsai Ming-liang,” to give him similar creative freedom. “I told him, ‘Don’t yell cut so quickly. Let me improvise a little.’ And being a fan of Tsai Ming-liang, Yeo agreed.”\nKnown for his minimalist acting style, Lee describes himself as “a naturalistic actor” whose performances “come from the inside, and so it might come out not very exaggerated or very big, but at least the audience will feel that it’s very natural.”\nBeyond the upcoming “Walker” films, Lee’s schedule remains busy. He has completed “A New Old Play” director Qiu Jiongjiong’s “Fuxi: Joy in Four Chapters,” which is a work-in-progress selection at the Hong Kong — Asia Film Financing Forum (HAF) that runs concurrently with the Hong Kong FilMart. He is also reuniting with his “Absence” director Wu Lang. He notes some potential projects later in the year remain unconfirmed as he has “too many scripts on hand at the moment.”\nThe actor, who has predominantly taken on serious roles throughout his career, expressed interest in expanding his repertoire. “I’d like to try out Wu Xia or action films, because you don’t see much of those in Taiwan, but they should have called me when I was younger,” he says. “I also want to try out comedy, because actually I’m quite humorous. I think I want to bring some joy to audiences.”\nLee also reflected on the growing global recognition of Asian cinema. “I think it’s getting better. Korea, Singapore, Thailand, Taiwan – they’re all making excellent films,” he noted, underscoring the importance of international film festivals in providing exposure for Asian filmmakers.\nThe “Walker” series, which began in 2012, features Lee as a monk moving at an extremely slow pace through various urban environments, creating a meditative contrast between ancient spiritual practice and modern settings.",
        "image": "https://variety.com/wp-content/uploads/2025/03/Lee-Kang-sheng.jpg?w=1000&h=563&crop=1",
        "categories": [],
        "source": "variety",
        "topic": "entertainment",
        "estimatedReadingTime": 2
    },
    {
        "title": "Neo Sora Talks Political Divide in ‘Happyend’: ‘Japan Hasn’t Really Reflected on its Colonial Past’",
        "created_at": "2025-03-15",
        "description": "Neo Sora discusses how his Asian Film Awards nominated film 'Happyend' portrays friendship fracturing along political lines in a near-future Japan.",
        "authors": "Naman Ramachandran",
        "url": "https://variety.com/2025/film/news/neo-sora-happyend-interview-1236338227/",
        "text": "In an post-screening Q&A ahead of the Asian Film Awards in Hong Kong, filmmaker Neo Sora discussed his nominated feature “Happyend,” a contemplative exploration of fractured friendship against the backdrop of political unrest in near-future Japan.\nIn the film, in near-future Tokyo, the threat of a catastrophic quake looms. Two friends, Yuta (Kurihara Hayato) and Korean-origin Kou (Hidaka Yukito), prank their principal before graduation, leading to school surveillance installation.\nThe Tokyo-based director’s debut feature film weaves personal relationships with larger sociopolitical themes, creating what Sora describes as “differences in scale” between intimate character dynamics and sweeping social commentary. “The core of the film is friendship, but specifically the feeling you get when you lose a friend because of political differences,” Sora explained. “That’s a really small thing because it’s just between you and somebody else. But because the reason is a larger, social reason, one of the most important things I was trying to do was suggest the grandness of scale through these small interactions.”\nWorking within budget constraints, Sora made strategic choices to amplify the film’s impact. A protest scene originally in the script was cut, which Sora believes strengthened the narrative by focusing exclusively on Yuta’s perspective after his friend Kou walks away to pursue political activism. “Kou suddenly has this world that is inaccessible to us, just like it’s inaccessible to Yuta,” Sora said. “Those kinds of realizations that maybe we’re actually living in different worlds now, even though our worlds were once the same – those are the things that lead to the end of their friendship.”\nPopular on Variety\nSet in a near-future where DJ culture has become somewhat antiquated and AI-generated music dominates, “Happyend” explores resistance to commercialization. The film opens with authorities shutting down an underground music venue. “The majority of people listen to music generated by AI, depending on what it makes you want to listen to,” Sora revealed about the film’s setting. “This population of DJs go against that. They’re like, ‘No, we want to choose what we listen to ourselves and discover the things that really resonate with us today from the past.'”\nSora uses this narrative framework to examine Japanese identity and xenophobia, topics he connects directly to historical amnesia. “Something that I really want to interrogate is what even is Japanese identity,” Sora said. “It’s very constructed. When I was thinking about the reasons why there’s so much xenophobia and racism within Japan, I kind of came to the conclusion, after research, that it’s due to the fact that Japan hasn’t really reflected on its colonial past.”\nThe filmmaker elaborated on post-WWII policies: “After Japan lost the war in World War Two, there came this question of what to do with all these people who were in the colonies, or who were from the colonies but moved to Japan. The Japanese government was actually quite scared of giving citizenship to these former Japanese people because if they gain citizenship, they can vote.”\nDespite starting the screenplay eight years ago, Sora noted the film’s themes have only grown more relevant. “I wasn’t intentionally putting it out now for any reason,” he said. “It just takes time to develop, especially a first narrative feature film.”\nThe director also discussed his approach to specific technical elements, including a haunting, silent earthquake scene that was designed not to trigger audiences who had experienced actual seismic events.\nWhen asked about low voter turnout among Japanese youth versus the film’s focus on protests, Sora highlighted that one main character, Kou, lacks voting rights due to his residency status as a Zainichi Korean. “I don’t necessarily think voting is the be-all, end-all in political engagement and action,” Sora added. “Assembling on the streets, assembling in public, actually is maybe the highest form of democratic action you can possibly do.”\n“Happyend” is nominated in the best new director and best newcomer (Kurihara) categories at this year’s Asian Film Awards, with winners to be announced Sunday night in Hong Kong. The film debuted at Venice and has won awards at Golden Horse and Goteborg.",
        "image": "https://variety.com/wp-content/uploads/2025/03/Neo-Sora.jpg?w=1000&h=563&crop=1",
        "categories": [],
        "source": "variety",
        "topic": "entertainment",
        "estimatedReadingTime": 3
    },
    {
        "title": "Sammo Hung Keeps Action Real While Hollywood Follows: ‘I’m Preserving the JC (Jackie Chan) Style, Not CG’",
        "created_at": "2025-03-15",
        "description": "Martial arts legend Sammo Hung talks preserving action choreography, his memories with Jackie Chan, and lessons for young filmmakers.",
        "authors": "Naman Ramachandran",
        "url": "https://variety.com/2025/film/news/sammo-hung-jackie-chan-bruce-lee-donnie-yen-1236338293/",
        "text": "Sammo Hung has seen it all. From battling Bruce Lee on screen in “Enter the Dragon” (1973) to bossing Donnie Yen behind the camera as the action director of “Ip Man” (2008), the legendary martial artist now wields influence as jury president of this year’s Asian Film Awards. The man who helped define Hong Kong action cinema for generations is now evaluating its future.\nThe 73-year-old action star, whose career spans over five decades, has transitioned seamlessly between acting, directing, and producing, crafting some of the most influential martial arts films in cinema history. When asked about the evolution of martial arts choreography from the classic Golden Harvest days to today’s spectacles, Hung remains philosophical. “I think there’s not much difference. It always evolves with time and evolves with trends,” Hung tells Variety.\nHung’s collaborations with Jackie Chan and Yuen Biao have produced countless iconic moments in action cinema. “We always have a lot of good memories for every single movie that we collaborate with each other,” he reflects. “For instance, like in ‘Project A’ and also ‘Dragons Forever.’ For these two films in particular, we always have good memories from that time.”\nPopular on Variety\nIn an era dominated by CGI, Hung emphasizes the physical authenticity that defined Hong Kong action while acknowledging modern techniques. “I’m preserving the JC style, not CG,” he says. “I don’t know much about computer graphics, but we are always using our body to express, to deliver the energy, the character.”\nHe’s quick to clarify: “I’m not saying that computer graphics is bad. I’m just saying that we have to see how we are going to use it in a proper way.”\nOf all his many roles in the industry, Hung finds directing the most challenging. “If I were a producer or an actor, I had time to choose, to grasp what I’m going to do. But as a director, you have to grab every single minute, every second to think and then to design what you’re going to do.”\nOn Hollywood’s appropriation of Hong Kong action techniques, Hung observes: “Hollywood has been also following the Hong Kong action films. They have been following the Hong Kong trends, the Hong Kong film styles.”\nHung’s unique blend of physical prowess and humor has been his trademark. “From my own perspective or from my own personality, I think it is important to incorporate comedy into action films,” he explains. “I’m not only making kung fu or martial arts films. I’m also making films that people can enjoy and have fun.”\nThe veteran performer has no favorites among his extensive filmography. “It applies to every single film that I made and I was starring in. I just hope that the audience would love all of them.”\nHung notes that the approach to martial arts filmmaking has evolved significantly from the time he began working in the 1960s to “Twilight of the Warriors: Walled In,” the action dram in 2024 broke box office record in Hong Kong, and was selected as the territory’s Oscar contender. “The sensitivity, or the sense of what a kung fu or martial arts film should be like has been changing. In the past, once we had a story, once we had the characters fixed, then we could just go for it. But these days, this is far, far more complicated.”\nAge has naturally impacted his physical capabilities, but not his commitment. “When I was young, of course, I could do far more action stunts compared with what I can do right now. I’m getting older now, but I still do my best, and I will still do what I can do within my ability or range.”\nHaving worked with Bruce Lee early in his career and more recently with Donnie Yen, Hung reflects on the stark contrast between these experiences. “When I was working with Bruce Lee, I was influenced by him significantly, because he’s the boss, of course, and he told me what to do. But in the case of Donnie Yen, I’m the boss, so I’m telling him what to do. That’s the significant difference.”\nWhen asked if there’s any genre he hasn’t tackled yet, Hung jokes: “The only genre that I haven’t been exposed to, maybe those like steamy, hot scenes, like sexy scenes.” Asked if he’s eager to explore it, he quips: “If there’s a chance, of course I would.”\nFor aspiring filmmakers looking to break into action cinema, Hung’s advice is pragmatic: “First of all, luck is very important. They have to be lucky. I’m not denying that you have to work hard as well. But in Cantonese, we have a saying: we have to work hard, but we always say we have to wait until the luck arrives.”\nAs for his legacy, Hung hopes to inspire the next generation. “For me right now, it’s hard to make a film that looks like what I did in the past. It’s quite impossible. So what I hope is the young filmmakers will watch my previous films, and they will learn something, get inspiration from me. And then, of course, if they could, in return, inspire me, that would be a great thing.”\nThe Asian Film Awards take place Sunday, after which Hung is attending Hong Kong FilMart.",
        "image": "https://variety.com/wp-content/uploads/2025/01/Sammo-Hung1.jpg?w=1000&h=563&crop=1",
        "categories": [],
        "source": "variety",
        "topic": "entertainment",
        "estimatedReadingTime": 4
    },
    {
        "title": "‘Slanted’ Review: Extreme Makeover Satire Critiques Lopsided Beauty Standards Through Asian Eyes",
        "created_at": "2025-03-15",
        "description": "An immigrant high school student hastily tries an experimental race-changing procedure that allows her to experience life as a white girl in the high-concept comedy that won SXSW.",
        "authors": "Peter Debruge",
        "url": "https://variety.com/2025/film/reviews/slanted-review-sxsw-1236337162/",
        "text": "If high school is a popularity contest — the mistaken-priorities assumption that drives writer-director Amy Wang’s SXSW-winning assimilation satire “Slanted” — then Chinese American senior Joan Huang (Shirley Chen) could be justified in ditching her heritage for a shot at being crowned prom queen. That’s the devil’s bargain Wang entertains in a provocative comedy-cum-thought-experiment that veers hard into “The Substance” territory when Joan agrees to a radical racial overhaul so thorough, Wang substitutes a different actor (Mckenna Grace) as her new persona for the rest of the movie.\nStaring tricky identity issues in the face, “Slanted” draws from Wang’s upbringing as it identifies the social pressures that might drive Joan to go the Michael Jackson route. The pop star is never named, but is by far the most visible example of someone who resculpted himself according to prevailing beauty standards.\nFrom the moment 8-year-old Joan arrives in the U.S. (played by Kristen Cui at that point), she’s confronted with signs of what the locals consider to be desirable: billboards with blond, bikini-clad models; Norman Rockwell-like propaganda art on the classroom walls; and a freckle-faced bully who makes fun of her eyes.\nPopular on Variety\nFlash-forward nine years, and Joan (now played by a grad school-aged actor) is bleaching her hair and doctoring her selfies with the Ethnos app (designed to make people of color look white). It feels edgy to call out such self-effacing, approval-chasing behavior at a time when appearance-altering practices are widespread, and potentially controversial to suggest that what Joan wants most is to be white.\nWhen you think about it, that’s pretty much the opposite premise of the one Jordan Peele floated with “Get Out,” in which rich white folks who covet Black excellence implanted their brains in Black bodies. But Wang, who also wrote the upcoming “Crazy Rich Asians” sequel, lacks Peele’s gift for complexity. Her script for “Slanted” is very funny at times, but ultimately too safe as it ironically considers the question of whether being white is better — or easier, at least.\nAfter learning that the most popular girl in her class, Olivia (Amelie Zilber), won’t be running for prom queen, Joan begins her makeover in earnest. But it’s not until Ethnos representatives reach out to offer Joan a path to making those “improvements” permanent that “Slanted” departs from your typical “Mean Girls” comedy. As the Ethnos pitch goes, “If you can’t beat ’em, be ’em.”\nBefore that, “Slanted” rehashes a lot of the usual stuff: frustration over not being part of the cool clique and futile attempts to fit in. In Joan’s case, it doesn’t help that her mom (Vivian Wu) packs odoriferous homemade meals, like chicken feet, for lunch — which Joan sells to her unconditionally loyal bestie Brindha (Maitreyi Ramakrishnan). Still, Joan’s dye job does seem to earn her points with Olivia, who invites her for mani-pedis at the Asian-owned nail salon, hoping that Joan (who speaks Mandarin at home) can get them the “locals” discount.\nSuch details, which likely wouldn’t have occurred to a white screenwriter, pack the punch of genuine, experience-based stand-up comedy — they’re relatable, whatever one’s upbringing, but also specific enough to resonate. The script’s big leap occurs the moment Joan exits the Ethnos procedure, looking like … well, Mckenna Grace. Wang could have gone the “White Chicks” route, using makeup to communicate (and potentially even parody) the transformation, Instead, the joke here is that she emerges a completely different person, pretending to be a new student named Jo Hunt.\nIt’s a risky gambit, and one that walks a tonal tightrope not unlike that of “Emilia Peréz” last year, as audiences wait to see what Wang plans to do with this development. Conveniently, there are no bandages and no recovery time needed. Joan steps out of the clinic, and her life is instantly different: Strangers smile and engage her on the street, and young men turn to check her out.\nFunnier still is the scene when Joan comes home and her parents don’t recognize her. Back in the 1980s and ’90s, Hollywood was a regular factory for “be careful what you wish for” farces, from “Something Special” to “Big” to countless body-swap movies. Cringey as those movies can be to watch, the genre remains uniquely suited to exploring prejudice and other identity issues.\nThe problem with “Slanted” is that the downside of the irreversible procedure has nothing to do with learning that self-acceptance is more important than the affirmation of one’s peers. Rather, there’s a nasty side effect, whereby her new pretty face starts to peel and eventually collapse altogether — which amounts to a condemnation of plastic surgery more than the identity-scrubbing she goes through.\nRacism isn’t the only factor making the cultural adjustment difficult for Joan, though Wang’s no-offense approach downplays aspects such as class and gender. Still, it’s worth noting that Joan’s father (Fang Du) works as a janitor at Clarksville High School, in addition to cleaning houses for members of the community — sources of potential shame for someone who feels poor by comparison with her fellow students. No wonder Jo’s big popularity-building coup post-surgery is claiming an acquaintance’s mansion as her own and hosting a big party there.\nGrace has the most challenging role here, which is to let audiences see the insecure soul peering out from within this new body. As the movie builds to its big prom finale, Wang springs a few clever surprises en route to a fairly predictable, if far from pat ending. Reductive as the outcome may be, the writer-director remains undeniably daring, spinning comedy from an inferiority complex and coming out on top.",
        "image": "https://variety.com/wp-content/uploads/2025/03/Slanted.jpg?w=1000&h=563&crop=1",
        "categories": [],
        "source": "variety",
        "topic": "entertainment",
        "estimatedReadingTime": 4
    },
    {
        "title": "Ten30 Pictures’ Head on Netflix Original Series ‘GO!’ and Plans to Turn Joburg Studio Into ‘A24 of Africa’ (EXCLUSIVE)",
        "created_at": "2025-03-15",
        "description": "Ten30 Pictures founder Kutlwano Ditsele says the Netflix series 'GO!' set the model for how he can turn his Joburg studio into 'the A24 of Africa.'",
        "authors": "Christopher Vourlias",
        "url": "https://variety.com/2025/tv/global/ten30-pictures-netflix-go-a24-africa-1236338266/",
        "text": "South African producer Kutlwano Ditsele’s Ten30 Pictures is developing a slate of projects to follow on the heels of the Netflix original series “GO!,” which launches globally March 21.\nSpeaking to Variety in Johannesburg, where the streamer will host the show’s premiere on March 16, Ditsele said this is just the first step for his young production outfit, insisting he plans on turning Ten30 into “the A24 of Africa.”\n“The biggest thing is to have an identity that says these stories are different to what’s [already out there],” he said. “Now our job is scaling and looking around the country for filmmakers that are making interesting things and filmmakers that have an interesting voice.”\n“GO!” stars Thandolwethu Zondi as Siya “Bolt” Gumede, a young sprinter who’s given a life-changing scholarship to a prestigious school in Johannesburg, only to find that while it’s one thing to achieve success on the track, it’s much harder to outrun the past. The six-part series was created by Ditsele and head writer Thuli Zuma, whose credits include the hit Showmax original “The Wife.” The show is directed by Tristan Holmes, who won an Academy Award in 2006 for his student film “Elalini.”\nPopular on Variety\nThe series marks the veteran producer’s return to TV after a brief hiatus, with Ditsele — whose credits include the hit MultiChoice dramas “Gomora” and “The Herd” — stressing his determination to “find a way to make the business work for me.”\nHis previous work, which included a stint at top Johannesburg production house the Bomb Shelter, was almost entirely built on a commissioning model that’s become increasingly challenging in South Africa’s difficult economic climate. Instead, Ditsele said he asked himself: “How do we start shifting what I’m able to do and start having some ownership in it?”\nTo do so required the buy-in of private investors, rather than pre-licensing agreements with broadcasters or streaming platforms that would wrest away both ownership and creative control. With “GO!,” Ditsele set a $1 million budget for the six episodes, an amount that would allow his backers to turn a tidy profit if a buyer like Netflix came calling. (It did — literally, when Ditsele says the streamer’s former content head in Africa picked up the phone, telling him: “Don’t speak to anybody else. We want this show.”)\nJust as importantly, Ditsele knew he could pitch that budget to investors in the banking and mining sectors whose portfolios regularly include investments in the millions — if not billions — of rand. “The budget level that I’m speaking about doesn’t necessarily scare them,” he said.\nHaving sold “GO!” to Netflix in what he described as the “pilot phase” of his long-term project, Ditsele and his investors are now targeting a 250 million rand ($13.7 million) funding round that would allow Ten30 to dramatically ramp up its operations.\nThe company’s slate currently includes the medical drama “Clinical,” which follows six young interns navigating personal and professional dramas in the high-stakes world of South Africa’s most prestigious public hospital; and the road drama “Imbali ne iNkabi,” a story of romance, redemption and survival that follows a contract killer sent to take out his childhood sweetheart. A second season of “GO!” is also in development.\nIn building out the slate at Ten30 — which reflects his goal to have a catalog of 30 titles in the next 10 years — Ditsele said he’s looking for filmmakers who are willing to take risks, telling them: “The first thing that I want you to send me is all the projects that the networks said ‘no’ to.”\nIt’s a model that again draws inspiration from America’s leading indie shop. “All the things that likely wouldn’t have been greenlit by anybody else get greenlit by A24. You start finding interesting voices in that way,” he said.\nDitsele, who’s represented by Talitha Watkins, a co-founder with Issa Rae and Deniese Davis of the management and production company ColorCreative, isn’t limiting his creative scope to South Africa: He’s currently attached to a “massive show” with a U.S. studio, alongside “GO!” co-creator Zuma.\nWorking in the Hollywood system, he said, has allowed him to think and create on “a completely different scale” than what he can accomplish back home. “You’re able to do something a lot bigger, a lot more global.” It also means working with a not-inconsiderable American checkbook attached.\nFor the time being, though, Ditsele said Ten30 “occupies a little space that allows networks to engage with us in a space that could be exciting. And I think ‘GO!’ is the perfect example,” he added. “We believe that we can make great work. We’ll take the risk.”\nThe Joburg Film Festival runs March 11 – 16.",
        "image": "https://variety.com/wp-content/uploads/2025/03/MixCollage-14-Mar-2025-02-50-PM-5450.jpg?w=1000&h=563&crop=1",
        "categories": [],
        "source": "variety",
        "topic": "entertainment",
        "estimatedReadingTime": 3
    },
    {
        "title": "HBO’s ‘True Detective: Night Country’ Set for TNT Run; ‘Hacks’ to Air on TBS Before Season 4 Premiere on Max (EXCLUSIVE)",
        "created_at": "2025-03-15",
        "description": "Warner Bros. Discovery is once again experimenting with sampling some of its premium pay TV and streaming content on its owned cable networks",
        "authors": "Jennifer Maas",
        "url": "https://variety.com/2025/tv/news/true-detective-night-country-tnt-hacks-tbs-1236338031/",
        "text": "Warner Bros. Discovery is once again experimenting with sampling some of its premium pay TV and streaming content on its owned cable networks, this time sampling HBO‘s “True Detective: Night Country” and Max’s “Hacks.”\nBeginning on March 28, “True Detective: Night Country,” which consists of six episodes, will air on TNT.\nFrom April 3-7, “Hacks” will air its first three seasons on TBS with two episodes going back to back per night. The event leads into the “Hacks” Season 4 premiere April 10 on Max.\nAs is customary for mature content, the episodes will be edited to meet the standards and practices guidelines for cable.\nWhile not the first time HBO content has aired on Warner Bros. Discovery’s cable networks — “Silicon Valley” and “True Blood” aired on TBS and TNT, respectively, in 2023 — this marks the first time the premium channel has released content that is currently airing or only recently ended, rather than older library titles that made their way to cable several years ago, such as “Sex and the City.”\nPopular on Variety\nThe sampling experiment is led by Channing Dungey, chairman and CEO of Warner Bros. Television Group and US Networks, who is using her newly expanded role as chief of the portfolio of cable networks to drive viewership to cable while also targeting potential new subscribers for HBO and Max.\n“We are excited to begin experimenting with new ways to utilize our incredible WB library and latest programming from our sister companies across our leading cable networks,” Dungey said. “With ‘Hacks’ and ‘True Detective: Night Country,’ we have award-winning, fan favorites to entice our viewers on networks and a compelling reason for HBO/Max viewers to engage with TNT and TBS, all in a virtuous cycle for WBD that elevates all our platforms and amazing shows.”\nWarner Bros. Discovery brass began teasing the plans last month with CEO David Zaslav saying during a Morgan Stanley media conference: “Channing is already looking with Casey at bringing some of the HBO content that we wouldn’t sell to others. And we’ll be talking about that in the next couple of weeks of stuff that you’ll start seeing on TNT and TBS, which will be new to a lot of viewers in America, and we think we will provide real value in terms of viewership.”",
        "image": "https://variety.com/wp-content/uploads/2024/06/TrueDetective-JodieFoster-KaliReis.1_dd41f1.jpg?w=1000&h=563&crop=1",
        "categories": [],
        "source": "variety",
        "topic": "entertainment",
        "estimatedReadingTime": 1
    }
]