[
    {
        "title": "Anthropic CEO says spies are after $100M AI secrets in a ‘few lines of code’",
        "created_at": "2025-03-12",
        "description": "Anthropic CEO Dario Amodei is worried about spies getting their hands on costly \"algorithmic secrets\" from the U.S.' top AI companies.",
        "authors": "Charles Rollet",
        "url": "https://techcrunch.com/2025/03/12/anthropic-ceo-says-spies-are-after-100m-ai-secrets-in-a-few-lines-of-code/",
        "text": "Anthropic’s CEO Dario Amodei is worried that spies, likely from China, are getting their hands on costly “algorithmic secrets” from the U.S.’s top AI companies — and he wants the U.S. government to step in.\nSpeaking at a Council on Foreign Relations event on Monday, Amodei said that China is known for its “large-scale industrial espionage” and that AI companies like Anthropic are almost certainly being targeted.\n“Many of these algorithmic secrets, there are $100 million secrets that are a few lines of code,” he said. “And, you know, I’m sure that there are folks trying to steal them, and they may be succeeding.”\nMore help from the U.S. government to defend against this risk is “very important,” Amodei added, without specifying exactly what kind of help would be required.\nAnthropic declined to comment to TechCrunch on the remarks specifically but referred to Anthropic’s recommendations to the White House’s Office of Science and Technology Policy (OSTP) earlier this month.\nIn the submission, Anthropic argues that the federal government should partner with AI industry leaders to beef up security at frontier AI labs, including by working with U.S. intelligence agencies and their allies.\nThe remarks are in keeping with Amodei’s more critical stance toward Chinese AI development. Amodei has called for strong U.S. export controls on AI chips to China while saying that DeepSeek scored “the worst” on a critical bioweapons data safety test that Anthropic ran.\nAmodei’s concerns, as he laid out in his essay “Machines of Loving Grace” and elsewhere, center on China using AI for authoritarian and military purposes.\nThis kind of stance has led to criticism from some in the AI community who argue the U.S. and China should collaborate more, not less, on AI, in order to avoid an arms race that results in either country building a system so powerful that humans can’t control it.",
        "image": "https://techcrunch.com/wp-content/uploads/2025/03/GettyImages-1554687370.jpg?w=1024",
        "categories": [
            "AI",
            "Startups"
        ],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 1
    },
    {
        "title": "As Intel welcomes a new CEO, a look at where the company stands",
        "created_at": "2025-03-12",
        "description": "When Pat Gelsinger tool the helm at Intel in 2021, the company was already in rough shape. Here's what Intel's new CEO is walking into.",
        "authors": "Rebecca Szkutak",
        "url": "https://techcrunch.com/2025/03/12/as-intel-welcomes-a-new-ceo-a-look-at-where-the-company-stands/",
        "text": "Semiconductor giant Intel hired semiconductor veteran Lip-Bu Tan to be its new CEO. This news comes three months after Pat Gelsinger retired and stepped down from the company’s board, with Intel CFO David Zinsner and executive vice president of client relations Michelle Johnston Holthaus stepping in as co-CEOs.\nTan, who was most recently the CEO of Cadence Design Systems, is joining Intel — and rejoining the board — at an interesting time in the Silicon Valley company’s history. Intel has seen its fair share of ups and downs in the past few years — to put it mildly.\nWhen Gelsinger took the helm in February 2021, Intel was already struggling and was falling far behind its peers in the semiconductor race. At the time, the company was likely still reeling from missing out on the smartphone revolution in addition to missteps when it came to chip fabrication.\nIt was also an interesting time for the semiconductor industry at large. The sector had seen a lot of recent consolidation in late 2020, including AMD acquiring Xilink for $35 billion and Analog buying Maxim for $21 billion, among others.\nSo how was Gelsinger’s most recent tenure at Intel? Let’s take a look.\nGelsinger got right to work when he started. He announced a modernization plan for the company, dubbed IDM, or integrated device manufacturing. The first part of the goal was a $20 billion investment to build two new chip manufacturing facilities in Arizona, with plans to boost chip production in the U.S. and beyond.\nIn 2022, the company announced the second part of this IDM plan, which involved a three-pronged approach to chip manufacturing: Intel’s fabs, third-party global manufacturers, and building out the company’s foundry services. As part of this plan, the company announced it would acquire Tower Semiconductor for $5.4 billion to help build out Intel’s custom foundry services.\nThat deal fell through, however, after facing regulatory hurdles. It was canceled in the summer of 2023. At the time, TechCrunch reported that the merger not going through would have a serious impact on the company’s modernization plans. In September 2024, Intel took steps to transition its chip foundry division, Intel Foundry, to an independent subsidiary.\nThe time leading up to Gelsinger’s retirement was particularly tumultuous for Intel. The company’s stock price plummeted about 50% from the beginning of 2024 to Gelsinger’s departure in December. Intel announced plans to lay off 15% of its workforce, around 15,000 people, in August after dismal second-quarter results. At that time, Gelsinger said the company had struggled to capitalize on the AI boom in the same way its rivals had, and that despite falling behind, Intel had overgrown headcount.\nIn the time since Gelsinger’s departure, the company has delayed the opening of its Ohio chip factory — again — and decided not to bring its Falcon Shores AI chips to market.\nBut as Tan takes the lead, things may be starting to head in the right direction. Intel finalized a deal with the U.S. Department of Commerce to receive a $7.865 billion grant for domestic semiconductor manufacturing through the U.S. Chips and Science Act; Intel has already received $2.2 billion of that grant money, according to its fourth-quarter earnings call. The company was also able to notch a win when it comes to the popularity of its Arc B580 graphics card, which sold out after positive early reviews.",
        "image": "https://techcrunch.com/wp-content/uploads/2023/08/newsroom-robert-noyce-bldg-2.jpg.rendition.intel_.web_.1920.1080.jpg?resize=1200,675",
        "categories": [
            "AI",
            "Enterprise"
        ],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 2
    },
    {
        "title": "Browser Use, one of the tools powering Manus, is also going viral",
        "created_at": "2025-03-12",
        "description": "The virality of AI 'agent' platform Manus from Chinese startup Butterfly Effect has benefitted another tool: Browser Use.",
        "authors": "Kyle Wiggers",
        "url": "https://techcrunch.com/2025/03/12/browser-use-one-of-the-tools-powering-manus-is-also-going-viral/",
        "text": "Manus, the viral AI “agent” platform from Chinese startup Butterfly Effect, has had an unintended side effect: raising the profile of another AI tool called Browser Use.\nBrowser Use, which aims to make websites more accessible for agentic applications that perform tasks on a user’s behalf, has experienced explosive growth in the past week. Daily downloads more than quintupled from around 5,000 on March 3 to 28,000 on March 10, co-creator Gregor Zunic told TechCrunch.\n“The past few days have been really wild,” Zunic said via DM. “We are the biggest trending repository [on GitHub], got loads of downloads [and] all that actually converts to big usage numbers.”\nWhy the uptick? A post about how Manus leverages Browser Use garnered over 2.4 millions views and hundreds of reshares on X. Browser Use is one of the components Manus employs to execute various tasks, like clicking through site menus and filling out forms.\nZunic launched the eponymous company behind Browser Use with Magnus Müller last year out of ETH Zurich’s Student Project House accelerator. The pair thought web agents — agents that navigate websites and web apps autonomously — were going to be the “big thing” in 2025.\n“What started as casual brainstorming over a few lunches turned into a challenge: Let’s build something small, throw it on Hacker News, and see what happens,” Zunic said. “We put together an MVP in four days, launched it, and boom — number one. From there, it’s been an absolute rocket.”\nBrower Use extracts a website’s elements — buttons, widgets, and so on — to allow AI models to more easily interact with them. The tool can manage multiple browser tabs, set up actions like saving files and performing database operations, and handle mouse and keyboard inputs.\nBrowser Use the company charges for managed plans, but also offers a free, self-hosted version of its software. That’s the version that’s blown up in the days since Manus’ unveiling.\nZunic says he and Magnus are trying to “sell a shovel” to developers chasing after the gold rush of web agents.\n“We wanted to create a foundation layer that everyone will build browser agents on,” Zunic said. “In our minds, there will be more agents on the web than humans by the end of the year.”\nThat might sound overly bullish, but several analysts predict that the broader market for AI agents will indeed grow enormously in the months to come. According to Research and Markets, the sector will reach $42 billion in 2029. Deloitte anticipates that half of companies using AI will deploy AI agents by 2027.\nManus effect aside, Browser Use’s timing appears to have been fortuitous.\nUpdated 12:45 p.m. Pacific: An earlier version of this story incorrectly referred to “Browser Use” as “Browser User” in the headline. We regret the error.",
        "image": "https://techcrunch.com/wp-content/uploads/2015/03/browser.jpg?resize=1200,797",
        "categories": [
            "AI"
        ],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 2
    },
    {
        "title": "Estonia-based Blackwall raises €45 million Series B to protect SMBs from malicious online traffic",
        "created_at": "2025-03-12",
        "description": "A huge chunk of online traffic now comes from bots, both good and bad — but AI is boosting the latter. From DDoS attacks to scraping, there’s a renewed",
        "authors": "Anna Heim",
        "url": "https://techcrunch.com/2025/03/12/estonia-based-blackwall-raises-e45-million-series-b-to-protect-smbs-from-malicious-online-traffic/",
        "text": "A huge chunk of online traffic now comes from bots, both good and bad — but AI is boosting the latter. From DDoS attacks to scraping, there’s a renewed barrage of threats that companies have to deal with.\nAccording to cybersecurity entrepreneur Nikita Rozenberg, the impact is more severe for SMBs. “The main difference is that large enterprises typically can survive with that. Most of these threats can simply kill small businesses.”\nThis inspired him to start Blackwall, an Estonia-based startup formerly known as BotGuard that shares similarities with CloudFlare, Imperva and others, but with a focus on SMBs.\nThis focus also influenced its product roadmap: It recently launched an ad fraud prevention product that prevents e-commerce websites from having their ad spend consumed by bots.\nThe pace at which the startup has been launching new applications and plans to keep on doing so is one factor that resonated with Dawn Capital, the B2B-focused VC firm that is backing Blackwall’s €45 million Series B round (approximately $49.2 million).\nThe funding will help further develop new products beyond its flagship product, GateKeeper, a reverse proxy that inspects traffic, analyzes it — also using AI — and filters malicious requests in real time. These threats include bots, but also intruders, for instance.\nThat’s also why Blackwall rebranded to reflect its expanded scope. Rozenberg’s co-founder Denis Prochko came up with the new name, a nod to video game Cyberpunk 2077, in which a complex firewall called the Blackwall protects the Net from rogue AIs.\nVideo game lore aside, the reality of Blackwall is lower profile; to adapt to SMBs, it needs its offering to be both easy to use and automated, which means it is often invisible to end users. That’s also because Blackwall doesn’t sell to SMBs directly, and instead opted for what Rozenberg calls a “channel model.”\nThis strategy consists in partnering with intermediaries like hosting service providers, managed service providers and e-commerce platforms that are looking to improve their margins. Offering Blackwall to their customers can be a differentiation factor and also a way to lower costs incurred from malicious traffic.\nThat’s also why Blackwall is going for midmarket players that can’t spend millions on in-house product development like their largest competitors such as GoDaddy, and need external support to handle this issue. Conversely, the startup found this sales strategy particularly fruitful.\nPartnering with more than 100 of these players helped Blackwall scale quickly since its launch in 2019: With a team of 65, it claims that its services are now deployed across more than 2.3 million websites and applications.\nThe new funding will now help it double its headcount, and double down on its expansion into the U.S. and APAC markets. It will count on Dawn Capital’s support to do so, as well as from VC firm MMC Ventures, which participated in this round after leading the startup’s €12 million Series A just one year ago (approximately $13.1 million at today’s exchange rate.)",
        "image": "https://techcrunch.com/wp-content/uploads/2019/11/kasada.jpg?resize=1200,848",
        "categories": [
            "Security",
            "Fundraising"
        ],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 2
    },
    {
        "title": "FBI, EPA, and Treasury told Citibank to freeze funds as Trump administration tries to claw back climate money",
        "created_at": "2025-03-12",
        "description": "The accounts were frozen in February, but documents filed today make public details which had previously been unknown.",
        "authors": "Tim De Chant",
        "url": "https://techcrunch.com/2025/03/12/fbi-epa-and-treasury-told-citibank-to-freeze-funds-as-trump-administration-tries-to-claw-back-climate-money/",
        "text": "Citibank revealed in court filings on Wednesday that the FBI, the EPA, the EPA inspector general, and the Treasury Department have all requested that the bank freeze accounts of several nonprofits and state government agencies.\nThe accounts were frozen in February, but the new documents make public details that had previously been unknown, including a full list of the nonprofits under FBI scrutiny.\nThe funds were disbursed as part of the $27 billion Greenhouse Gas Reduction Fund, which was created by the Inflation Reduction Act, a law passed by Congress in 2022. Of that, the EPA received $14 billion for a National Clean Investment Fund, which provides grants to green banks.\nGreen banks use those funds to provide financing for clean technology projects around the country. Startups that have technologies that are ready to scale commercially were eligible to receive financing to make projects a reality.\nThe funding was mostly to be used for loans, which were to be paid back and recycled for future lending. Green banks tend to have delinquency rates on par with commercial and residential portfolios held by other commercial lenders.\nCitibank was selected as the financial agent to administer that money, holding it in accounts under the names of the awardees. It is also administering a separate, $6 billion Clean Communities Investment Accelerator program. The EPA’s contract with Citibank was publicly announced in April 2024.\nThe FBI has requested that Citibank place 30-day administrative freezes on accounts held by nonprofits that were recipients of the green bank funding. It also asked the bank to freeze other nonprofit and state government agency accounts, including Habitat for Humanity, United Way, the Colorado Clean Energy Fund, and New York State Department of Taxation and Finance.\nThree nonprofits that received green bank funds have sued Citibank, asking the bank to release the money in their accounts.\nEPA administrator Lee Zeldin has said that the Greenhouse Gas Reduction Fund doesn’t align with the agency’s priorities and that he has concerns about fraud, though he has not provided evidence to support that claim.",
        "image": "https://techcrunch.com/wp-content/uploads/2025/03/GettyImages-1497343848.jpeg?resize=1200,800",
        "categories": [
            "Climate"
        ],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 1
    },
    {
        "title": "Food delivery startup Wonder acquires media company Tastemade for $90M",
        "created_at": "2025-03-12",
        "description": "Food delivery startup Wonder is acquiring media company Tastemade for $90 million, the Wall Street Journal reports.",
        "authors": "Aisha Malik",
        "url": "https://techcrunch.com/2025/03/12/food-delivery-startup-wonder-acquires-media-company-tastemade-for-90m/",
        "text": "Food delivery startup Wonder is acquiring media company Tastemade for around $90 million, according to The Wall Street Journal. Founded in 2012, Tastemade produces food, travel, and home videos and operates several free, ad-supported streaming television (FAST) channels.\nThe acquisition gives Wonder access to a content studio, production company, and advertising business. Wonder will leverage all of these assets to promote its brands to a wider audience, the company says.\nThe deal marks Wonder’s latest step toward its mission to create a mealtime “super app.” Wonder founder and CEO Marc Lore, who was previously Walmart’s head of e-commerce, wants to turn Wonder into an AI app that not only tells you what to eat but also automatically orders it for you from Wonder kitchens.\nWith this acquisition, users may soon be able to place a delivery order for a dish that they’re seeing being prepared by a chef on a Tastemade streaming channel.\nWonder’s past acquisitions include Blue Apron and Grubhub. The startup has raised a total of $1.6 billion to date.",
        "image": "https://techcrunch.com/wp-content/uploads/2022/10/tc-disrupt-2022-marc-lore-5.jpg?resize=1200,800",
        "categories": [
            "Startups"
        ],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 0
    },
    {
        "title": "Google DeepMind unveils new AI models for controlling robots",
        "created_at": "2025-03-12",
        "description": "Google DeepMind's Gemini Robotics models are designed to enable real-world machines to interact with objects, navigate environments, and more.",
        "authors": "Kyle Wiggers",
        "url": "https://techcrunch.com/2025/03/12/google-deepmind-unveils-new-ai-models-for-controlling-robots/",
        "text": "Google DeepMind, Google’s AI research lab, on Wednesday announced new AI models called Gemini Robotics designed to enable real-world machines to interact with objects, navigate environments, and more.\nDeepMind published a series of demo videos showing robots equipped with Gemini Robotics folding paper, putting a pair of glasses into a case, and other tasks in response to voice commands. According to the lab, Gemini Robotics was trained to generalize behavior across a range of different robotics hardware, and to connect items robots can “see” with actions they might take.\nDeepMind claims that in tests, Gemini Robotics allowed robots to perform well in environments not included in the training data. The lab has released a slimmed-down model, Gemini Robotics-ER, that researchers can use to train their own models for robotics control, as well as a benchmark called Asimov for gauging risks with AI-powered robots.",
        "image": "https://techcrunch.com/wp-content/uploads/2025/03/Screenshot-2025-03-12-at-3.34.00PM.png?resize=1200,591",
        "categories": [
            "AI",
            "Hardware",
            "Robotics"
        ],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 0
    },
    {
        "title": "How to watch Nvidia GTC 2025, including CEO Jensen Huang's keynote",
        "created_at": "2025-03-12",
        "description": "Here's how to watch Nvidia's biggest event of the year, GTC. GTC 2025 is returning to San Jose, California from March 17 to March 21.",
        "authors": "Kyle Wiggers",
        "url": "https://techcrunch.com/2025/03/12/how-to-watch-nvidia-gtc-2025-including-ceo-jensen-huangs-keynote/",
        "text": "GTC, Nvidia’s biggest conference of the year, will return starting Monday in San Jose. If you can’t make it in person, don’t sweat it. TechCrunch will be on the ground covering the major developments.\nMany of the biggest presentations, talks, and panels will be livestreamed as well. Nvidia CEO Jensen Huang is scheduled to deliver a keynote from the SAP Center on Tuesday at 10 a.m. PT, which you’ll be able to stream and watch online at Nvidia.com without having to register and on Nvidia’s YouTube channel.\nWe’re expecting Huang to reveal more about Nvidia’s next flagship GPU series, Blackwell Ultra, and the next-gen Rubin chip architecture. Also likely on the agenda: automotive, robotics, and lots and lots of AI updates.\nNvidia.com is also where you’ll find a catalog of all the virtual and on-demand sessions at GTC, including workshops on efficient large language model customization, conversations on generative AI for core banking, and demos of datasets for specialized domains like biology.",
        "image": "https://techcrunch.com/wp-content/uploads/2025/01/GettyImages-2192223928.jpg?resize=1200,801",
        "categories": [
            "Enterprise",
            "Transportation",
            "AI"
        ],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 0
    },
    {
        "title": "Intel appoints Lip-Bu Tan as its next CEO",
        "created_at": "2025-03-12",
        "description": "Intel has appointed Lip-Bu Tan, a respected figure in the semiconductor industry, as CEO.",
        "authors": "Kyle Wiggers",
        "url": "https://techcrunch.com/2025/03/12/intel-appoints-lip-bu-tan-as-its-next-ceo/",
        "text": "Intel has appointed Lip-Bu Tan, a major figure in the semiconductor industry, as CEO, the company announced late Wednesday.\nTan succeeds interim co-CEOs David Zinsner and Michelle Johnston Holthaus. He’ll also rejoin the Intel board of directors after stepping down from the board in August 2024, Intel said. Zinsner will remain Intel’s CFO, while Johnston Holthaus will remain CEO of the company’s Intel Products division.\nTan, a Malaysia-born, longtime tech investor, formerly served as CEO of Cadence Design Systems. He was a manager at two energy firms, EDS Nuclear and ECHO Energy, and a partner at the Walden USA investment fund before founding venture capital firm Walden International in 1987.\nTan is exceptionally well-connected in the tech industry, and a director on the boards of Hewlett Packard Enterprise, Schneider Electric, and SoftBank. He’s also widely respected as a business leader. After Intel announced Tan’s appointment, the company’s stock jumped around 11% in after-hours trading.\nIn a statement, Tan said that Intel will be an “engineering-focused company” under his leadership.\n“We will push ourselves to develop the best products, listen intently to our customers, and hold ourselves accountable to the commitments we make so that we build trust,” he said. “We also have a responsibility to deliver for our shareholders — something I am equally focused on and expect will be an outcome of our renewed focus on customers.”",
        "image": "https://techcrunch.com/wp-content/uploads/2024/04/GettyImages-1831946092.jpg?resize=1200,675",
        "categories": [
            "Hardware"
        ],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 1
    },
    {
        "title": "Nvidia GTC 2025: What to expect from this year's show",
        "created_at": "2025-03-12",
        "description": "Nvidia is hosting its GTC 2025 conference in San Jose, California from March 17 to March 21. Here's what to expect, including new Blackwell GPU reveals.",
        "authors": "Kyle Wiggers",
        "url": "https://techcrunch.com/2025/03/12/nvidia-gtc-2025-what-to-expect-from-this-years-show/",
        "text": "GTC, Nvidia’s biggest conference of the year, begins Monday and runs till Friday in San Jose. TechCrunch will be on the ground covering the news as it happens — and we’re expecting a healthy dose of announcements.\nCEO Jensen Huang will give a keynote address at the SAP Center on Tuesday at 10 a.m. Pacific, focusing on — what else? — AI and accelerating computing technologies, according to Nvidia. The company is also teasing reveals related to robotics, sovereign AI, AI agents, and automotive — plus 1,000 sessions with 2,000 speakers and close to 400 exhibitors.\nHere’s how to watch the Nvidia GTC 2025 keynote online, along with many other sessions, talks, and panels.\nSo what do we expect to see at GTC? Well, Nvidia typically reserves a big chunk of the conference for GPU-related debuts. A new, upgraded iteration of the company’s Blackwell chip lineup seems likely.\nDuring Nvidia’s most recent earnings call, Huang confirmed that the upcoming Blackwell B300 series, codenamed Blackwell Ultra, is slated for release in the second half of this year. In addition to higher computing performance, Blackwell Ultra cards pack more memory (288GB), an attractive feature for customers looking to run and train memory-hungry AI models.\nRubin, Nvidia’s next-gen GPU series, is almost certain to get a mention at GTC alongside Blackwell Ultra. Due out in 2026, Rubin promises to deliver what Huang has described as a “big, big, huge step up” in computing power.\nHuang said during the aforementioned Nvidia earnings call that he’d talk about post-Rubin products at GTC, as well. That could be Rubin Ultra GPUs, or perhaps the GPU architecture that’ll come after the Rubin family.\nBeyond GPUs, Nvidia may illuminate its approach to recent quantum computing advancements. The company has scheduled a “quantum day” for GTC, during which it’ll host execs from prominent companies in the space to “[map] the path toward useful quantum applications.”\nOne thing’s for sure: Nvidia could use a win.\nEarly Blackwell cards reportedly suffered from severe overheating issues, causing customers to cut their orders. U.S. export controls and fears of tariffs have massively depressed Nvidia’s stock price in recent months. At the same time, the success of Chinese AI lab DeepSeek, which developed efficient models competitive with models from leading AI labs, has prompted investors to worry about the demand for powerful GPUs like Blackwell.\nHuang has asserted that DeepSeek’s rise to prominence will in fact be a net positive for Nvidia because it’ll accelerate the broader adoption of AI technology. He has also pointed to the growth of power-hungry so-called “reasoning” models like OpenAI’s o1 as Nvidia’s next mountain to climb.\nTo be clear, Nvidia isn’t exactly hurting. The company reported a record-breaking quarter in February, notching $39.3 billion in revenue and projecting $43 billion in revenue for the subsequent quarter. While rivals such as AMD have begun to encroach on the company’s territory, Nvidia still commands an estimated 82% of the GPU market.",
        "image": "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-2183848501.jpg?resize=1200,800",
        "categories": [
            "AI",
            "Enterprise",
            "Transportation"
        ],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 2
    },
    {
        "title": "The people in Elon Musk's DOGE universe",
        "created_at": "2025-03-12",
        "description": "Meet the DOGE staffers and senior advisors in Elon Musk's inner circle, and how they got there.",
        "authors": "Kirsten Korosec; Zack Whittaker; Charles Rollet; Sean O'Kane; Lorenzo Franceschi-Bicchierai",
        "url": "https://techcrunch.com/2025/03/12/the-people-in-elon-musk-doge-universe/",
        "text": "Elon Musk has spent decades building a universe of companies that has served as an incubator for up-and-coming engineers and a proving ground for his inner circle.\nThat universe — an ecosystem of Silicon Valley tech titans, veterans of his companies like Tesla and SpaceX, and a crop of fresh-faced hackers and software engineers — has now collided with the U.S. federal government.\nThe dozens of individuals who work under, or advise, Musk and the Trump-ordered Department of Government Efficiency — individuals who TechCrunch has identified or confirmed independently — reflects more than the billionaire’s proclivity to collect talent. They are a real-life illustration of Musk’s web-like reach in the tech industry.\nTechCrunch set out to report on or confirm the individuals working as Musk representatives in the U.S. government. Importantly, we’ve sought to show the connections between them, and how and when they entered Musk’s orbit.\nAlong the way, TechCrunch has made some new discoveries, including new details about DOGE and its workers and an xAI-powered chatbot on a DOGE-related website subdomain that is hosted on a Musk acolyte’s website.\nSince publishing, TechCrunch has learned that DOGE cut cybersecurity staff at CISA, and confirmed several more Musk-linked DOGE associates, including a former VC who now works at the Social Security Administration.\nHow we got here\nTechCrunch interviewed people who have worked with Musk and DOGE staffers. We used public and open source data, such as historical internet records and chat logs, to confirm parts of our reporting. We also relied on services like the Internet Archive’s Wayback Machine to access archived copies of websites that are no longer online. Public information, such as court records, payments transactions, other media reports, and past TechCrunch reporting were also used.\nTechCrunch reached out to all those named for an opportunity to comment. For those whose contact information we did not have, TechCrunch contacted known representatives, including the Trump administration.\nWhen reached for comment, a White House spokesperson provided a statement to TechCrunch. (The spokesperson sent the email “on background,” but we are publishing in full as we were given no opportunity to decline the terms.)\n“DOGE is fulfilling President Trump’s commitment to making government more accountable, efficient, and, most importantly, restoring proper stewardship of the American taxpayer’s hard-earned dollars. Those leading this mission with Elon Musk are doing so in full compliance with federal law, appropriate security clearances, and as employees of the relevant agencies, not as outside advisors or entities. The ongoing operations of DOGE may be seen as disruptive by those entrenched in the federal bureaucracy, who resist change. While change can be uncomfortable, it is necessary and aligns with the mandate supported by more than 77 million American voters,” the statement read.\nThis is a living document, as the DOGE team is likely to expand and evolve over the coming weeks. Scroll down to learn about the individuals in the DOGE universe, which have been broken down by type: Musk’s inner circle; senior figures; worker bees; and aides, some of whom are advising and recruiting for DOGE.\nIf you know more about DOGE, contact TechCrunch securely. You can also share documents via SecureDrop.\nInner circle\nElon Musk\nRole: DOGE Lead, Unpaid “Special Government Employee”\nGravitas. Obsession. Ambition. Risk-taker.\nElon Musk observers and sycophants have pointed to these traits to explain his rise from a bright-eyed immigrant landing in the United States to one of the world’s richest and most powerful people, and now a right-hand to President Donald Trump.\nThe overlooked secret sauce is Musk’s ability to get talented people to sign on to “the mission.”\nThat there are multiple, overlapping, and evolving missions — saving the planet through sustainable transport and energy, solving traffic, making humanity multiplanetary, or protecting public conversation — doesn’t really matter.\nThe biggest carrot was, and has always been, Musk’s “us versus them” framing, according to five sources who had lengthy stints at Tesla and spoke to TechCrunch on condition of anonymity.\nIn the past, the “them” might be local regulators, the press, or legacy automakers. Today, the people working closely with Musk to complete his next mission via the Department of Government Efficiency have a new “them” to battle: waste and bureaucrats.\nMusk has talked at length about government agencies that should be “deleted entirely.” Meanwhile, Musk’s companies have benefited from government contracts and incentives. His company SpaceX has been awarded more than $20 billion in contracts from NASA, the Department of Defense, and other federal agencies, according to data from USASpending.gov.\nMusk is an unpaid special government employee, according to the White House. Per a filing on February 17, the Trump administration said Musk is a White House employee and a senior advisor to the president. According to the Trump administration’s executive order, DOGE is a temporary government organization whose authorities are set to expire in July 2026.\nSteve Davis\nRole: Long-time Musk insider\nSteve Davis is a long-time Musk confidant. He began working at SpaceX as one of its earliest employees in 2003 after earning a master’s degree in aerospace engineering from Stanford University, according to the Los Angeles Times.\nBy 2016, Musk tapped Davis to run what at the time was his newest far-fetched idea: An underground transit play known as The Boring Company. On his watch, The Boring Company raised hundreds of millions of dollars and built a few short so-called “Tesla tunnels” in Las Vegas. But the company has also ended up dropping its previously announced plans for tunnels in cities like Los Angeles and Chicago, according to The Wall Street Journal.\nDavis has a reputation as a relentless negotiator, and Musk brought him on board at Twitter to help with the takeover and subsequent slash-and-burn. Davis and his family reportedly slept in a makeshift bedroom at the company’s headquarters during this time. In a 2023 lawsuit against Twitter filed by former employees, the plaintiffs alleged that Davis said to the effect of, “we don’t have to follow those rules,” in response to a request to get permits to install a bathroom for Musk.\nDavis has served as a member of the board of advisors of the Atlas Society, a group centered around the philosophy of Ayn Rand, per Bloomberg. Davis is now helping Musk slash government headcount, which Rand once called the “worst part” of the “producers’ burden.”\nNicole Hollander\nRole: X employee\nNicole Hollander garnered public attention in the aftermath of Elon Musk’s $44 billion acquisition of Twitter in early 2022.\nThe George Washington University alum and former employee of real estate developer JGB Smith (per her LinkedIn profile) was part of the polarizing Twitter transition team that upended the company and slashed its workforce. As part of that transition, Hollander and Musk ally Steve Davis moved into the company’s headquarters with their infant, according to a civil lawsuit filed in 2023. The lawsuit was filed by several former Twitter employees against X Corp., the Musk entity that took over. The plaintiffs said in the complaint Hollander was not employed by any of Musk’s companies at that time.\nHollander’s relationship with Davis — and her current employment at X — has kept her in Musk’s circle. Her role at DOGE doesn’t have an official title, at least one that is public. However, Wired reported in late January that Hollander has high-level access to federal agencies and an official government email address.\nBrian Bjelde\nRole: Senior Advisor, Office of Personnel Management\nBrian Bjelde is a true Elon Musk veteran, with 21 years at SpaceX, where he was employee No. 14 and continues to work today. While he started as an avionics engineer, Bjelde has spent the last decade running the company’s human resources department.\nIn a 2014 Reddit “ask me anything,” Bjelde said that at SpaceX, “We try not to limit our thinking except by the limits imposed by physics.”\nSeveral former employees sued SpaceX and Musk in 2024 alleging sexual harassment and a hostile work environment. According to the complaint, Bjelde once starred in a video for the space company where a staffer spanked him — an apparent attempt at tongue-in-cheek humor — and he also was involved in the firings of several employees who spoke up about the company’s culture in 2022.\nPrior to SpaceX, Bjelde spent a year at NASA’s Jet Propulsion Laboratory after graduating from the University of Southern California with a master’s degree in astronautical engineering.\nAt DOGE, Bjelde is reportedly a senior advisor at OPM.\nAmanda Scales\nRole: Chief of Staff, Office of Personnel Management\nAmanda Scales doesn’t directly work for DOGE, but is now chief of staff at the Office of Personnel Management, the federal government’s main human resources department, according to an OPM memo.\nScales used to work on talent acquisition at Musk’s company x.AI until January 2025, according to her LinkedIn profile. She also worked in human resources and talent at San Francisco-based VC firm Human Capital, as well as at Uber. Scales graduated from University of California, Davis in 2012 with degrees in psychology and economics, per her LinkedIn.\nBranden Spikes\nRole: Head of IT at X; Former DOGE Operative\nSpikes serves as the head of IT at X since February 2025, according to his LinkedIn profile. Prior to that, he said in his X bio that he had “most recently” worked for DOGE. Spikes recently confirmed to journalist Brian Krebs that he worked for DOGE for two months in Washington, D.C. “to help save [the country] from certain bankruptcy.”\nSpikes is a longtime Musk insider, touting on his LinkedIn profile that he was the fourth hire at SpaceX and was among the first employees at PayPal. Spikes’ ex-wife is married to Musk’s cousin, Krebs reported.\nSenior figures\nJehn Balajadia\nRole: Long-time Musk assistant\nJehn Balajadia first joined the Musk ecosystem in 2017, according to her LinkedIn profile, which lists her title as operations coordinator at The Boring Company.\nBut LinkedIn records don’t always reflect actual positions — and their evolution — in Musk’s world. In 2018, Balajadia took over the executive assistant to the office of CEO position, a role that included managing all of Musk’s activities and often those of his family members, according to interactions between a TechCrunch reporter and SpaceX and Musk employees at the time.\nToday, Balajadia has a role within DOGE. According to The New York Times, she is listed in the employee directory of the Education Department.\nThe book “Breaking Twitter” claims Balajadia once told another Musk official that her job was to “take care” of him, and she reportedly often travels with Musk. When Musk took over Twitter, Balajadia was named chief of staff, and she was the one who delivered letters of dismissal to several Twitter executives, per Walter Isaacson’s book on Elon Musk.\nPrior to joining Tesla, Balajadia worked at Red Bull, NBCUniversal, and Walt Disney.\nRiccardo Biasini\nRole: Senior Advisor to the Director of the Office of Personnel Management\nRiccardo Biasini entered into Musk’s orbit in 2011 when he joined Tesla as an engineer after completing his master’s degree in automotive engineering from the University of Pisa, Italy the previous year.\nDuring his five years at Tesla, Biasini focused much of his attention on Autopilot, the company’s branded advanced driver assistance system, according to his own account outlined in a Medium post. He led development of Autopilot’s traffic-aware cruise control and other driver assistance features before taking responsibility for the architecture of controls, safety, and functional behavior of the electric propulsion system.\nBiasini left Tesla and joined Comma.ai in 2016, where he developed the automated lateral and longitudinal controls for the startup’s first self-driving car system. He later became VP of quality and eventually was named CEO in 2018 after founder George Hotz stepped down from the leadership role.\nBiasini went back to work for Musk in 2019 as director of electrical and software engineering at The Boring Company.\nAt DOGE, Biasini is senior advisor to the director of the Office of Personnel Management, according to a lawsuit filed against the OPM in the U.S. District Court for the District of Columbia, which provides his title as listed on an OPM document entitled “Privacy Impact Assessment for Government-Wide Email System.”\nAmy Gleason\nRole: Acting DOGE administrator\nAmy Gleason is the acting DOGE administrator, according to the White House, making Gleason the official albeit ostensible head of the Department of Government Efficiency, even if Elon Musk is largely calling the shots.\nThe White House confirmed Gleason’s position to TechCrunch. Gleason previously served at the U.S. Digital Service — now DOGE — between October 2018 and December 2021, according to her LinkedIn profile, which TechCrunch has seen. Gleason also previously worked as chief product officer at Russell Street Ventures between December 2021 and November 2024.\nGleason reports to the White House chief of staff, Susie Wiles, per the executive order establishing DOGE.\nPresident Trump has continued to refer to Musk as heading and leading DOGE.\nMichael Russo\nRole: Chief Information Officer, Social Security Administration\nMichael Russo, a former technology executive, began serving as the chief information officer at the Social Security Administration in early February. As CIO, Russo oversees the agency’s IT systems and information security.\nSoon after his appointment, Russo, who is aligned with DOGE, reportedly quickly gave access to several DOGE staffers at the agency, including Akash Bobba and Scott Coulter, among others, according to a lawsuit brought by unions representing workers and a person familiar with personnel matters. Several other DOGE staffers were listed as Russo’s direct reports in the department’s staff directory, the person familiar said.\nRusso was previously the chief technology officer at ecommerce firm Shift4 and was a senior director at cloud giant Oracle, headed by Larry Ellison, a close ally of President Trump.\nChristopher Stanley\nRole: Unspecified role at White House\nStanley began working for Musk in October 2022, per his LinkedIn profile, when he was hired for the “core transition team” at Twitter after Musk’s takeover. Stanley can be seen at the time taking this widely seen selfie at Twitter’s headquarters with other people who were not fired or quit when Musk took control of Twitter.\nStanley has since taken on an unspecified role at the White House, according to The New York Times. Stanley himself has hinted at working in the Trump administration on his X account.\nOn January 20, the day of Trump’s inauguration, Stanley posed next to two January 6 convicts, brothers Matthew and Andrew Valentin, who were pardoned by Trump. Stanley wrote in an X post that he was “boots on ground to ensure this was executed.” Trump’s Department of Justice liaison Paul Ingrassia wrote on X that the Valentin brothers were the first January 6 prisoners to be released.\nStanley is also the head of security engineering at X and the principal security engineer at SpaceX, according to his website. On his LinkedIn, Stanley says he is also the chief information security officer at X Payments, a payment service that Musk has wanted to launch as part of his “everything app” aspiration for X.\nBefore entering Musk’s orbit, Stanley had his own cybersecurity firm, named Stanley Networks, and worked as a contractor at the state of Kentucky. He also worked at Kentucky health provider Baptist Health, which includes hospitals and other facilities.\nTechCrunch found an xAI-powered chatbot on a DOGE-related website subdomain on Stanley’s website, called the “Department of Government Efficiency AI Assistant,” which says it is “here to help government personnel like you identify and eliminate waste, improve efficiency, and streamline processes using a first principles approach.”\nWorker bees at DOGE\nAkash Bobba\nRole: Expert, Office of Personnel Management\nAkash Bobba is a DOGE engineer who is reportedly a student at the University of California, Berkeley, according to Wired. The New Jersey native graduated high school in 2021, according to public records seen by TechCrunch. It’s unclear how his experiences brought him to DOGE. But he has had some interactions with the tech world.\nAccording to a since-deleted podcast with Aman Manazir, Bobba said he previously interned at Meta and Palantir. He also worked at Bridgewater Associates.\nBobba’s website as of February 2025 points to a specific point in a YouTube video, titled, “How Tech Billionaires Plan to Destroy America,” in which Elon Musk says, “I’m not just MAGA. I’m dark gothic MAGA.”\nPer Wired, Bobba is listed as an “expert” in internal OPM correspondence, and reports directly to OPM’s chief of staff, Amanda Scales.\nAccording to a lawsuit filed by union workers, Bobba also has a presence at the Social Security Administration and worked under the agency’s chief information officer, Michael Russo, according to the lawsuit and a person familiar with personnel matters. Bobba was sworn into his post “over the phone, contrary to standard practice,” per the lawsuit, implying Bobba worked for DOGE at least in part remotely.\nEdward Coristine\nRole: Special Government Employee\nEdward Coristine, a former intern at Neuralink and now known by his infamous LinkedIn profile handle “bigballs,” is one of the core members of the DOGE team and the youngest-known Musk aide at age 19, TechCrunch has confirmed.\nSince arriving in Washington, D.C., Coristine has been actively involved in accessing federal systems at several government departments, including Office of Personnel Management, the SBA, GSA and USAID, the State Department, Homeland Security, and FEMA.\nPrior to DOGE, Coristine ran several companies under his name from his family home in New York, including DiamondCDN and Packetware, both which offered forms of DDoS protection.\nCoristine also used to work for DDoS mitigation company Path Network until he was fired in June 2022 following an alleged “leaking of proprietary company information that coincided with his tenure,” Path CEO Marshal Webb told TechCrunch in an email. Coristine said in a later Discord post under his handle “Rivage,” seen by TechCrunch and per other news reports, in response to his firing that he had done “nothing contractually wrong.”\nIt was around May 2024 that Coristine went to work for Elon Musk’s Neuralink. Coristine is also a mechanical engineering and physics student at Northeastern University, and expected to graduate in 2028.\nScott Coulter\nRole: IT Specialist, Social Security Administration\nScott Coulter is an IT specialist working for DOGE at the Social Security Administration, according to a lawsuit filed by union workers and a person familiar with personnel matters.\nPrior to working for DOGE, Coulter headed Cowbird Capital, a New York investment fund founded in 2018, which listed assets of around $171 million as of March 2024, per a regulatory filing.\nBoth Coulter and Cowbird were named in court documents during the Twitter v. Musk lawsuit in 2022 during Musk’s takeover of Twitter, though it’s not clear why either were named.\nCoulter was listed as an IT specialist in the Social Security Administration’s staff directory as of mid-February, according to the person familiar. Coulter did not respond to a request for comment sent to his government email address.\nMarko Elez\nRole: Special Government Employee, U.S. Treasury\nSince joining DOGE, Marko Elez has become a central figure in a legal battle over DOGE’s access to some of the federal government’s most sensitive systems. Now as a senior Treasury employee, Elez has access to the U.S. Treasury’s payments systems responsible for disbursing around $6 trillion in federal funds to Americans, such as Social Security checks and federal tax refunds.\nNamed in a lawsuit challenging DOGE’s access, Elez is a “special government employee” and reportedly had wide data access privileges to the department’s systems before that access was curtailed by a federal court. He works closely with Tom Krause, another DOGE staffer and senior Treasury employee. Per a February 11 court filing, Elez is the only DOGE staffer with access to payment systems.\nBefore government, the 25-year-old Rutgers University graduate worked at SpaceX, where he focused on vehicle telemetry, Starship, and satellite software, according to an archived copy of his website seen by TechCrunch. Elez later worked on search AI at Musk’s social media company X, per an archived copy of his website. Elez does not list any prior government experience.\nOn February 6, Elez briefly resigned from his position at DOGE, according to the White House press secretary Karoline Leavitt, after The Wall Street Journal surfaced racist posts from Elez’s social media accounts. Elez may return to government after Musk posted a poll on X asking whether Elez should be rehired. Elez was reinstated at DOGE, a Washington Post reporter posted on February 18.\nLuke Farritor\nRole: Senior Advisor, DOGE\nLuke Farritor is listed as a senior advisor in several U.S. government department employee directories, including the State Department, USAID, and the Department of Energy. He also requested access to data held by Medicare and Medicaid, as well as the Consumer Finance Protection Bureau.\nBefore government, Farritor, 23, was a student at the University of Nebraska, Lincoln and was well known for decoding the writings on ancient Roman scrolls, for which he won a $700,000 prize. Later, Farritor was among the 2024 Thiel Fellowship class, an annual award given by the billionaire Peter Thiel. An archived copy of Farritor’s website says he worked for Nat Friedman and Daniel Gross, who he helped to “invest a large, multistage VC fund and help run AI Grant.” (Neither Friedman or Gross responded to a request for comment.)\nFarritor worked as an intern at Elon Musk’s satellite internet company Starlink in mid-2022, then went on to work at SpaceX between May 2022 and July 2023, where he worked on “several mission-critical projects” leading up to Starship Flights 1 and 2, per his website.\nGautier ‘Cole’ Killian\nRole: DOGE “Volunteer”; Federal Detailee\nGautier “Cole” Killian is described as a DOGE “volunteer” who was designated a “federal detailee” at the U.S. Environmental Protection Agency in early February. A federal detailee is a federal employee usually seconded from another government agency.\nKillian was a student at McGill University in Canada where he studied math and computer science, and was a member of McGill’s AI team between 2021 and 2022. His personal website was scrubbed from the internet in late 2024, according to his website’s public DNS records.\nGavin Kliger\nRole: Special Advisor to the Director of the Office of Personnel Management\nGavin Kliger is an alum of University of California, Berkeley, and works at Databricks. Kliger joined the DOGE team earlier in 2025.\nKliger is listed as special advisor to the director of the OPM on his LinkedIn profile, per Reuters, though much of Kliger’s online life, including his X account, has since been scrubbed from the internet, including the Wayback Machine, which archives copies of webpages in case they later become unavailable.\nA copy of Kliger’s resume that TechCrunch has seen said he previously interned at Twitter in mid-2019.\nAccording to an email sent to USAID staff, Kliger also has a USAID email address, and was one of the DOGE staffers who is now listed in the CFPB’s staff directory, according to the CFPB’s union.\nTom Krause\nRole: Special Government Employee, U.S. Treasury; CEO, Cloud Software Group\nTom Krause is a special government employee and a senior DOGE staffer in the U.S. Treasury. He concurrently serves as the chief executive of Cloud Software Group, a private company that owns several tech firms, including remote access giant Citrix, a once public outfit that went private through a series of deals.\nBloomberg reports that Krause eliminated jobs at Citrix that staff said were critical to the security of the company’s products, according to multiple employees both named and unnamed for the story. Cloud Software Group told Bloomberg it inherited weaknesses at Citrix and faced rising security threats across the industry, and that cybersecurity has improved since its private equity buyout and meets or exceeds all industry standards.\nBefore becoming CEO of Cloud Software, Krause, who is 47, was a former executive at Broadcom; prior to that he ran a consultancy firm.\nSince working at the Treasury as one of Musk’s DOGE front-line staffers, Krause has worked closely with Marko Elez, another senior Treasury employee.\nJeremy Lewin\nRole: DOGE Staffer\nJeremy Lewin is a DOGE staffer assigned to the General Services Administration, which oversees the federal government’s massive procurement and logistics operations, Bloomberg reported. Lewin reportedly failed to gain access to a secure GSA area, resulting in a superior of his lobbying the CIA for a clearance.\nLewin is a 27-year-old Harvard Law School graduate who recently worked at the same law firm, Munger, Tolles & Olson, as did U.S. Second Lady Usha Vance, The Handbasket reported.\nAram Moghaddassi\nRole: DOGE Operative\nMoghaddassi is part of a DOGE team assigned to the U.S. Department of Labor, and is one of several staffers that DOGE plans to install at the U.S. Treasury, per The New York Times.\nMoghaddasi has worked for at least three of Musk’s companies: X and Neuralink, according to multiple media reports, and a cached copy of Moghaddassi’s X account in 2023 said he also previously worked on AI at Tesla.\nMoghaddassi appears to be in his twenties. In 2019, he was a sophomore at University of California, Berkeley, where he studied applied math and computer science, the Santa Fe Institute’s website says.\nNikhil Rajpal\nRole: DOGE Staffer\nNikhil Rajpal studied computer science and history at the University of California, Berkeley, where he served as the president of the libertarian-leaning student political group, Students for Liberty.\nAccording to archived snapshots of his website, Rajpal worked at Twitter from 2016 until some time before Musk’s acquisition. He may have first entered Musk’s orbit prior to this, reportedly doing work redesigning a Tesla console.\nOn behalf of DOGE, Rajpal works at the National Oceanic and Atmospheric Administration and has a DOGE email address.\nKyle Schutt\nRole: DOGE Technologist\nSchutt is a technologist with longstanding links to Republican politics and was more recently linked to political operations by Elon Musk. Schutt reportedly has access to systems at FEMA.\nAccording to his since-deleted GitHub profile, which TechCrunch has seen, Schutt works at a company called Outburst Data. According to security researchers, Outburst Data hosts part of DOGE’s website and several other Musk-related sites, including his America PAC political fundraiser. TechCrunch has also seen the same DNS records, which reference a DOGE-named subdomain.\nOn February 14, 404 Media reported a flaw that it said allows anyone to edit DOGE’s website.\nSchutt also serves as the chief technology officer at Revv, an online fundraising platform that is widely used by the Republican Party, as well as co-founder of Virginia-based software company KAMM.\nEthan Shaotran\nRole: DOGE Staffer\nEthan Shaotran, 22, and a California native, is a DOGE staffer and also a Harvard University student in the class of 2025. Shaotran was first publicly linked to Musk in September 2024, when he was runner-up in a hackathon run by the billionaire’s AI company xAI.\nShaotran was previously the founder of Energize.ai, though its website no longer loads. He also developed several iPhone apps, including a Donald Trump-themed running game called “Donald Dash.”\nShaotran reportedly has a working GSA email address and requested access to a decade’s worth of GSA data. Shaotran also has access to email systems at the Department of Education and access to the department’s back-end website.\nThomas Shedd\nRole: Director of Technology Transformation Services, GSA\nThomas Shedd is a former Tesla engineer who now serves as the director of the General Services Administration’s Technology Transformation Services, or TTS, a unit known for designing and building digital services for the federal government.\nSince Shedd took charge of the unit, the GSA fired its 18F division of specialist technology consultants who worked on the Internal Revenue Service’s free tax-filing system and other government projects.\nSeveral staffers also reportedly resigned after Shedd gained access to parts of Notify.gov, a system that sends mass text messages to the public during emergencies, which contains the personal information of Americans who registered.\nPrior to working in federal government, Shedd worked at Tesla for eight years, according to the GSA, where he worked on “building software that operates vehicle and battery factories.” It’s not clear what prior government service Shedd has, if any, but he has said he wants to run TTS like a “startup software company,” according to Wired magazine, including the use of AI to analyze government contracts.\nJordan Wick\nRole: DOGE Staffer\nJordan Wick is a former Waymo software engineer who appears to have a DOGE email account associated with the Executive Office of the President, Wired reported. Wick is among the team that was given access to Consumer Financial Protection Bureau systems.\nWick is also the co-founder of Y Combinator startup Intercept, according to YC’s website. An archived version of Wick’s website says that as of 2022, he had “recently” graduated with a master’s degree in engineering from MIT.\nChristopher Young\nRole: DOGE Staffer\nYoung is a DOGE staffer who was given a Consumer Financial Protection Bureau email address, per Bloomberg.\nThat address was reportedly copied in an email about four other DOGE workers needing to be onboarded and provided with CFPB building access. Young is a “top Republican field operative” who was hired as Musk’s political advisor in 2024, The New York Times reported. Young has worked in Republican politics since at least 2007, according to his LinkedIn profile.\nAides and advisors\nMarc Andreessen\nRole: Unofficial Advisor to DOGE\nMarc Andreessen, the co-founder of Silicon Valley VC firm Andreesen Horowitz, doesn’t formally work for DOGE but has acted as “a key networker for talent recruitment” at the agency, according to The Washington Post.\nAndreessen has jokingly referred to himself as an “unpaid intern” for DOGE, as well.\nGeorge Cooper\nRole: DOGE Recruiter\nCooper is a Palantir engineer who worked on DOGE’s recruiting efforts in late 2024, according to Wired. He graduated from Pennsylvania’s Lehigh University in 2019 with a bachelor’s degree in computer science and business, according to his LinkedIn profile.\nCooper worked to hire other Palantirians to join DOGE as they are “the most exceptional people I know,” he wrote in a message, seen by Wired.\nVinay Hiremath\nRole: DOGE Recruiter\nHiremath, 32, is the co-founder of video recording startup Loom, which was sold to Atlassian in 2023 for $975 million. According to a blog post on his website titled “I am rich and have no idea what to do with my life,” Hiremath worked for DOGE in late 2024 for about a month making hundreds of recruiting calls. He wrote that he was added to DOGE-tied Signal groups and “immediately put to work.”\nWhile Hiremath praised DOGE’s work as “extremely important,” Hiremath said he quit as he needed to focus on himself, calling off plans to move to Washington, D.C. and going to Hawaii instead.\nAnthony Jancso\nRole: DOGE Recruiter\nJancso is a former Palantir software engineer who also worked on DOGE’s recruitment efforts late in 2024, according to Wired. In 2023, Jancso co-founded Accelerate SF, an initiative that taps engineers to solve the city’s problems with AI. Jancso’s exact age isn’t public, but he graduated from University College London in 2021 with a bachelor’s degree in economics according to his LinkedIn profile, seen by TechCrunch. Jancso was himself recruited to DOGE by Boring Company president Steve Davis.\nMichael Kratsios\nRole: DOGE Recruiter\nKratsios helped lead efforts to staff DOGE in late 2024, conducting interviews of prospective staff, Bloomberg reported. Kratsios was previously managing director of Scale AI and the chief technology officer of the United States under President Trump’s first term. He was also a principal at Thiel Capital, a VC firm founded by Peter Thiel, from 2014 to 2017, according to his LinkedIn.\nKatie Miller\nRole: DOGE Advisor & Spokesperson\nKatie Miller is a Trump-appointed advisor to DOGE, and has served as its spokesperson. Miller served in the first Trump administration and is the spouse of Trump’s deputy chief of staff, Stephen Miller. Miller also serves on a presidential advisory board related to intelligence matters.\nTo contact TechCrunch securely about DOGE, reach out via Signal and WhatsApp. You can also share files and documents via SecureDrop.\nThis was originally published February 18, 2025, and will be updated regularly.",
        "image": "https://techcrunch.com/wp-content/uploads/2025/02/musk-doge-workers-final.jpg?resize=1200,900",
        "categories": [
            "Security"
        ],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 26
    },
    {
        "title": "Travis Kalanick thinks Uber screwed up: \"Wish we had an autonomous ride-sharing product\"",
        "created_at": "2025-03-12",
        "description": "Travis Kalanick, the former CEO of Uber, made it clear on Wednesday: he believes the company’s decision to abandon its autonomous driving program was a",
        "authors": "Connie Loizos",
        "url": "https://techcrunch.com/2025/03/12/travis-kalanick-thinks-uber-screwed-up-wish-we-had-an-autonomous-ride-sharing-product/",
        "text": "Travis Kalanick, the former CEO of Uber, made it clear on Wednesday: he believes the company’s decision to abandon its autonomous driving program was a mistake. Said Kalanick at the Abundance Summit in L.A., “Look, [new management] killed the autonomous car project we had going on. At the time, we were really only behind Waymo but probably catching up, and we were going to pass them in short order . . . I wasn’t running the company when that happened, but you know, you could say, ‘Wish we had an autonomous ride-sharing product right now. That would be great.’”\nUber sold its self-driving unit in a reported fire sale to the self-driving tech developer Aurora in 2020, three years after Kalanick was forced to step down. At the time, it made sense; autonomous driving was bleeding cash, and Uber had already spent hundreds of millions of dollars on the effort. Now, Waymo’s self-driving cars are tooling around the Bay Area, Los Angeles, Phoenix and popping up in new markets.\nWaymo recently partnered in Austin with Uber, and Uber is betting its platform will be critical in growing the service. But business is business, and partnerships falter. If Waymo decides it doesn’t need a middleman, Uber, once the future of transportation, could find itself stuck in reverse.",
        "image": "https://techcrunch.com/wp-content/uploads/2019/04/GettyImages-488595694.jpg?resize=1200,803",
        "categories": [
            "Robotics",
            "Transportation"
        ],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 1
    },
    {
        "title": "UK competition probe of mobile browsers finds Apple-Google duopoly is 'anti-innovation'",
        "created_at": "2025-03-12",
        "description": "A U.K. competition authority investigation of Apple and Google's mobile browsers has concluded that the mobile duopoly's policies are \"holding back",
        "authors": "Natasha Lomas",
        "url": "https://techcrunch.com/2025/03/12/uk-competition-probe-of-mobile-browsers-finds-apple-google-duopoly-is-anti-innovation/",
        "text": "A U.K. competition authority investigation of Apple and Google’s mobile browsers has concluded that the mobile duopoly’s policies are “holding back innovation” and could also be limiting economic growth.\n“Mobile browsers are apps which provide the primary gateway for consumers to access the web on their mobile devices, and hence for businesses to reach them with their content and products. The issues we have identified mean that consumers could be missing out on new features when using mobile browsers; and businesses are limited in their ability to reach consumers through browser apps,” runs a summary of the 611-page final decision report published on Wednesday.\nMost of the concerns identified relate to “Apple’s policies that determine how mobile browsers, the way we access the web on mobiles, work on Apple’s devices,” per a press release.\nThese include issues such as Apple mandating the use of its WebKit browser engine for other browsers on iOS, which limits their ability to differentiate versus Apple’s own Safari browser by offering enhanced features; Safari having greater or earlier access to key platform features versus rival browsers, which the inquiry groups believes is crimping competition (including around privacy features), and holding back development of PWAs (progressive web apps) on iOS; limits on in-browsing which puts limits on rival browsers’ ability to serve app users who click on a link out to the web; and certain choice architecture issues.\nWhen it comes to Google, the investigating inquiry group’s concerns center on revenue sharing arrangements between Mountain View and Apple, whereby Google pays Apple a significant share of the search ad revenue earned from traffic on Safari and Chrome on iOS.\n“We have found that Apple and Google earn significant revenue when their key rival’s mobile browser is used on iOS for web searches on Google, significantly reducing their financial incentives to compete,” they observe, going on to note that the extent of the revenue-sharing is “so large” as to significantly limit the financial incentive to compete.\nBut still no enforcement in sight\nDespite this raft of negative findings — and despite U.K. competition concerns over Apple and Google’s grip on mobile dating back many years at this point — there’s still no competition enforcement action in sight; the report recommends waiting for special abuse control powers to kick in.\nThese are powers that would be unlocked if an active investigation of the two tech giants (opened in January) confirms they fall in-scope of beefed up antitrust powers wielded by the Competition and Markets Authority (CMA) since a major U.K. reform of competition law targeting digital giants came into force in January. So remedies for the anti-competitive issues identified remain up in the air.\nThe report advises against trying to remedy the competition concerns using standard market investigation powers — as it says there are “a number significant risks to the effectiveness of these measures.”\nCloud gaming, which had also formed part of the market investigation, was dropped from the inquiry last November after some changes by Apple that the regulator deemed likely to alleviate competition concerns.\nThe report by the independent inquiry group, which was set up by the CMA when it opened a market investigation into Apple and Google’s grip on mobile back in November 2022, follows similar preliminary conclusions last fall. But the inquiry group now says it is no longer concerned about some specific choice screen issues it had previously raised.\nIt said an update by Apple in December making changes to how iOS users can switch their default browser resolved concerns it had had on that platform. While Google provided the inquiry group with “new evidence relating to its use of prompts to encourage users to set Chrome as their default browser on Android” that also resolved its concerns.\nAt the same time, the inquiry group still took issue with some other screen architecture design choices that they said could be making it harder for users to switch to alternative mobile browsers versus Apple’s Safari and Google’s Chrome native browsers.\nFuture remedies?\nThe final report suggests a range of potential remedies (or “appropriate interventions,” as it terms them) for the mobile browser competition concerns, which are set out in full in Appendix D.\nSuggested remedies include requiring Apple to allow the use of alternative browser engines and an interoperability requirement that would mandate equivalent access to iOS features for rival browsers, as well as a ban on the Chrome revenue share, among others.\nAdditionally, how Google displays browser choice screens could be regulated under this approach, including the frequency of default browser pop-ups.\nWhile none of the proposed remedies is being taken forward as part of this CMA market investigation, they could offer a steer of how the regulator might ultimately enforce on Apple and Google’s mobile duopoly.\nThat’s assuming its Digital Markets Unit’s investigation determines they have so-called Strategic Market Status (SMS), meaning they would fall under the special abuse control regime and could be subject to such bespoke interventions. The SMS investigations on Apple and Google are expected to conclude later this year.\nCommenting in a statement, Margot Daly, chair of the CMA’s independent inquiry group, wrote:\nThe analysis set out in our report and the range of potential interventions considered to address the market issues we have identified merits consideration by the CMA under its new powers, which have been specifically designed for digital markets. So, I welcome the CMA’s prompt action to open strategic market status investigations into both Apple and Google’s mobile ecosystems. The extensive analysis we’ve set out today will help that work as it progresses.\nApple and Google were contacted for comment on the inquiry group’s final report.\nHere’s Apple’s statement:\n“Apple believes in thriving and dynamic markets where innovation can flourish. We face competition in every segment and jurisdiction where we operate, and our focus is always the trust of our users. We have concerns with this report and believe the remedies it discusses would undermine privacy, security, and the overall user experience. We will continue to engage constructively with the CMA to best address their concerns.”\nGoogle also emailed the following remarks:\n“Android’s openness has helped to expand choice, reduce prices and democratise access to smartphones and apps. We remain committed to open platforms that help developers build successful businesses, and will work constructively with the CMA to deliver a pro-innovation, evidence-based and predictable regulatory regime that enables UK growth.”\nThis report was updated with Google’s statement",
        "image": "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-1237753209.jpg?resize=1200,800",
        "categories": [],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 5
    },
    {
        "title": "Vento rolls out new €75M fund for Italian founders, no matter where they live",
        "created_at": "2025-03-12",
        "description": "Over the last 15 years or so, as European venture capital shifted into a higher gear, one way to help a nation's ecosystem flourish was to invest in",
        "authors": "Mike Butcher",
        "url": "https://techcrunch.com/2025/03/12/vento-hopes-new-e75m-fund-for-italian-founders-anywhere-will-kick-italys-ecosystem-into-life/",
        "text": "Over the last 15 years or so, as European venture capital shifted into a higher gear, one way to help a nation’s ecosystem flourish was to invest in founders from that country, regardless of where they were based. This would help re-patriate the entrepreneurial mindset back home. In Europe, the approach was pioneered in part by Paris-based Kima Ventures. Now, a new venture firm hopes to replicate that idea from Italy.\nVento, one of Italy’s most active private early-stage VCs, is launching its second fund, hard-capped at €75 million, specifically to back Italian startup founders at home and abroad.\nThe sector-agnostic fund originated from the organizers of Italian Tech Week, held annually in Turin, which has hosted the likes of Sam Altman, Reid Hoffman, and Elon Musk, among others.\nThe event was originally launched by Fiat family scion John Elkann, chairman of Vento, but also chairman of Stellantis (the parent company of Fiat) and Exor (the holding company of the Agnelli family, which controls Fiat and other assets).\nUnderstandably for someone of his status, Elkann has an extensive network both in Europe and Silicon Valley, which he helps bring to ITW. So it’s perhaps no coincidence that Vento’s Investment Committee includes such tech industry veterans as Diego Piacentini, Mike Volpi (formerly of Index Ventures), and Jean de La Rochebrochard. Ironically, Rochebrochard recently joined the very same Kima Ventures that Vento hopes to emulate, after being controversially removed from Newwave, a French venture outfit, last year.\nTo date, Vento has already invested in 100 startups including Bee, JetHR and Qomodo. Fund II plans to invest in 375 investments over five years, said the company.\nDiyala D’Aveni, CEO of Vento, told TechCrunch over a call that, “Italy is quite behind compared to other European countries, but we think the trajectory is the same as the others. So that’s why we’re doing this. Italian Tech Week is a way for us to bring people from outside of Italy, on the one side, to push incredible investors to meet Italian founders and see the potential of the Italian ecosystem, and inspire the talent in Italy to build their own companies. We think the fact that there are not many success stories in Italy is kind of preventing the ecosystem to grow.”\nAdded D’Aveni, “There’s no lack of capital. It’s a lack of companies, but we just need some success stories, and then the whole flywheel will kick off, and we will see what we saw in France.”\nItalian Tech Week feeds usefully into this strategy, allowing Vento to evaluate over 3,500 startups that apply to appear at the event, maintaining a selective 2.5% conversion rate with a standardized €150,000 ticket size, and with some follow-on investments being made.\nBut what was the problem with previous Italian tech founders that Elkann felt this fund would solve?\n“When we launched Vento’s first fund in 2022, we recognized that Italy’s technological and entrepreneurial potential was significantly underserved,” he told TechCrunch.\n“Italian founders have always demonstrated exceptional… entrepreneurial spirit, but the ecosystem was not there. Vento was created to address this gap by providing not just capital, but a comprehensive platform that combines direct investment, venture building, and network development through Italian Tech Week.”\nHowever, Italian company law is often considered less favorable to startup founders compared to UK or US company vehicles. Does he expect the startups that Vento funds to be Italy-domiciled or will it be agnostic?\n“Our primary commitment is to identify exceptional Italian founders and support them in their global entrepreneurial journey,” he said. “Italy is making significant strides to become increasingly competitive in the international technology landscape, and we are confident that soon these regulatory differences between countries will become less and less relevant.”\nTo be fair, Italy’s tech scene is improving. According to Dealroom data, venture capital investment in Italian startups totaled $5.72 billion across the last five years (2020 to 2024), a more than threefold increase from the previous five years, when it hit only $1.7 billion.\nD’Aveni added that there were already plans to reach out internationally: “We already have a network of founders outside of Italy who are sending us deals, as well as micro-communities of Italians in New York, London, Berlin and Paris, among others.”",
        "image": "https://techcrunch.com/wp-content/uploads/2025/03/Vento-team.jpg?w=925",
        "categories": [
            "Venture"
        ],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 3
    },
    {
        "title": "Bria lands new funding for AI models trained on licensed data",
        "created_at": "2025-03-13",
        "description": "Bria, a startup offering AI image-generating models trained exclusively on licensed content, has closed a new fundraising round.",
        "authors": "Kyle Wiggers",
        "url": "https://techcrunch.com/2025/03/13/bria-lands-new-funding-for-ai-models-trained-on-licensed-data/",
        "text": "AI-powered image generators, which are at the center of a number of copyright lawsuits against AI companies, are frequently trained on massive amounts of data from public websites. Most of these companies argue that fair use doctrine shields their data scraping and training practices. But many copyright holders disagree.\nThat’s why some startups and firms developing image generators are trying a different tack: Training generators exclusively on licensed content. New York and Tel Aviv-based Bria, founded in 2023 by entrepreneurs Yair Adato and Assa Eldar, is one of these.\nBria pays for images from around 20 partners, including Getty Images, and uses these to train image-generating models with content guardrails. Adato, Bria’s CEO, said that the platform “programmatically” compensates image owners according to their “overall influence.”\n“Bria foundation models house one billion visuals and millions of videos,” Adato told TechCruch. “Bria has mitigated biases that can sometimes emerge in AI-generated visual content by training its models on globally representative data sets. The company’s models consistently produce visuals that reflect diversity, making them suited for various creative applications.”\nBria offers plug-ins for image editing and design apps including Photoshop and Figma, as well as a fine-tuning API that allows customers to customize the company’s models for specific applications. Users can run Bria’s models on the company’s platform or an outside computing environment, like a public cloud. In either case, customers own the data and outputs, Adato said.\n“Enterprise customers can pay for access to source code and [models],” Adato said. “We provide over 30 specialized APIs for creating and modifying visuals, which customers access through subscription and usage-based pricing. Companies can pay to fine-tune our generative AI models with their brand assets, creating custom engines that maintain their visual identity.”\nBria’s plans are ambitious. Adato tells TechCrunch that the 40-person company seeks to foster an “IP ecosystem” where businesses can access licensed images from media conglomerates for use in commercial creations, with “built-in compliance.”\nBria also plans to expand its platform and models to support additional media types, including music, video, and text, as well as on-device applications.\n“Bria continues to thrive despite broader tech industry challenges,” Adato said. “While the sector faces headwinds from central tech company market maturation, macroeconomic pressures causing budget constraints, and oversaturation of basic AI wrapper applications, these factors strengthen Bria’s position.”\nWhile a growing number of ventures are trying to build businesses around licensed media generators, including Adobe, Spawning AI, and Shutterstock, Bria has managed to gain a foothold in the nascent market. On Thursday, the company announced that it raised $40 million in a Series B funding round led by Red Dot Capital with participation from Maor Investment, Entrée Capital, GFT Ventures, Intel Capital, and In-Venture.\nBringing Bria’s total raised to around $65 million, the majority of the new cash will be put toward product development, Adato said.\n“We are growing fast with our 40 customers, demonstrating significant annual recurring revenue growth of more than 400% last year,” Adato said. “We’re also expanding our team with additional expertise in several key areas: generative AI researchers and engineers in music and video, global sales and marketing leaders, IP and copyright experts, and generative AI consultants. We expect to double our team size by the end of the year.”",
        "image": "https://techcrunch.com/wp-content/uploads/2022/08/ai-gen-unfiltered.jpg?resize=1200,675",
        "categories": [
            "Startups",
            "AI",
            "Fundraising"
        ],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 2
    },
    {
        "title": "Could deeptech serve as Europe's path to autonomy from the US?",
        "created_at": "2025-03-13",
        "description": "Amidst geopolitical tensions and volatile markets, the question of Europe's ability to weather the storms ahead, especially as President Trump seems",
        "authors": "Mike Butcher",
        "url": "https://techcrunch.com/2025/03/13/could-europes-16b-deeptech-bet-be-a-path-to-autonomy-from-the-us/",
        "text": "Amidst geopolitical tensions and volatile markets, the question of Europe’s ability to weather the storms ahead, especially as President Trump seems intent on having his pound of tariffs from the continent, is looming large.\nBut an extensive new report claims deeptech is poised to become a key pillar of Europe’s security, defense, and future autonomy, in particular from the U.S.\nDeeptech attracted €15 billion ($16.3 billion) in venture investments in 2024, according to a 184-page report by venture firms Lakestar, Walden Catalyst, Dealroom and the deeptech conference, Hello Tomorrow. The report also found that nearly one-third of all venture capital invested in Europe is now going to deep tech.\nM&A activity in the space increased to $12.2 billion last year, the report said, but it also found that European deeptech startups still rely on the U.S. for exits. Furthermore, 50% of the growth capital raised by deeptech startups comes from outside the continent.\nStill, deeptech could also be seen as a hedge against normal “momentum investing” amongst venture capitalists, said the report.\nThe report’s co-author Lukas Leitner, also a deeptech investor at Lakestar, told TechCrunch that while geopolitical tensions pose significant challenges, Europe needs to embrace the moment, and deeptech could be the key that unlocks future resilience for the continent.\nHowever, the road ahead is not without challenges. The U.S. has a “flywheel effect” in deeptech while Europe’s ecosystem is still immature, Leitner noted. “We have a flywheel in the ‘shallow’ tech scene. You see a lot of second-time founders, coming out of Revolut and so on, building great companies. But not yet from deeptech companies.”\n“Europe has strong research institutions, engineering talent, and supportive public sentiment for deeptech, but there need to be policy changes to foster a culture that supports taking risks,” he added.\nArnaud de la Tour, the CEO of Hello Tomorrow, said that the notion that compute-poor Europe would always lag in AI was recently challenged by the appearance of open-source DeepSeek: “It’s a huge opportunity for Europe, because we have great AI talent […] Many are looking to come back to Europe because of the geopolitical landscape. But we definitely need to have the right policy framework in order to unlock the kind of potential that we have.”\nLeitner pointed out that Europe’s relative weakness in computing power is offset by its strengths in photonics computing, which offers major advantages in speed and efficiency. “We’re really good in Europe with photonics, because we have good laser systems, and we have good fundamental research on the photonic side,” he said.\nDe la Tour added that Europe could also take advantage of a brain-drain in the U.S. as science is defunded by the Trump administration. “The National Science Foundation, which is the biggest supporter of founder-applied research in the U.S. has had its budget cut by half. A lot of those great scientists don’t have a job anymore, and many could come to Europe,” he said.",
        "image": "https://techcrunch.com/wp-content/uploads/2023/02/GettyImages-886180226-e1676981025926.jpg?resize=1200,675",
        "categories": [
            "Venture"
        ],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 2
    },
    {
        "title": "Meta is launching Community Notes in the US next week",
        "created_at": "2025-03-13",
        "description": "Next week, Meta will begin one of the company's most significant overhauls ever for how it fact-checks information on its platforms. On March 18, Meta",
        "authors": "Maxwell Zeff",
        "url": "https://techcrunch.com/2025/03/13/meta-is-launching-community-notes-in-the-us-next-week/",
        "text": "Next week, Meta will begin one of the company’s most significant overhauls ever for how it fact-checks information on its platforms.\nOn March 18, Meta will start releasing its version of Community Notes for Facebook, Instagram, and Threads users in the United States. The program copies a crowdsourced fact-checking system that Twitter unveiled in 2021 and that became the sole means of correcting misleading information after Elon Musk turned the platform into X.\nMeta executives say they’re focused on getting Community Notes right in the U.S. before it rolls the feature out to other countries. It’s a high-stakes region for testing a major new feature, given that the U.S. is Meta’s most lucrative market, but Meta may be hesitant to roll out Community Notes in other regions such as the European Union, where the European Commission is currently investigating X over the effectiveness of its Community Notes feature.\nThe move could also signal Meta CEO Mark Zuckerberg’s eagerness to appease the Trump administration, which has previously criticized Meta for censoring conservative viewpoints.\nZuckerberg first announced these changes in January as part of a broader effort to give oxygen to more perspectives on his platforms. Since 2016, Meta has relied on third-party fact checkers to verify information on its platforms, but Neil Potts, Meta’s VP of Public Policy, told reporters in a briefing on Wednesday that the systems were too biased, not scalable enough, and made too many mistakes.\nFor example, Potts said Meta applied false fact-checking labels to an opinion article on climate change that appeared in Fox News and the Wall Street Journal. In another case, Zuckerberg recently said on Joe Rogan’s podcast that Meta should not have dismissed concerns around COVID-19 vaccines as misinformation.\nMeta hopes that Community Notes will address public perception that it’s biased, make fewer mistakes, and present a more scalable fact-checking system that ultimately addresses more misinformation. However, Meta notes this system does not replace Community Standards – the company’s rules that dictate whether posts are considered hate speech, scams, or other banned content.\nThe overhaul of Meta’s content moderation comes at a time when many tech companies are trying to address historical biases against conservatives. X has led the industry’s effort, with Elon Musk claiming to center his social platform around “free speech.” OpenAI recently announced it was changing how it trains AI models to embrace “intellectual freedom” and said it would work to not censor certain viewpoints.\nRachel Lambert, Meta’s Director of Product Management, said in the Wednesday briefing that Meta is basing its new fact-checking system off of X’s open-source algorithms around Community Notes.\nMeta opened applications for contributors to its Community Notes network in February. Meta’s contributors will be able to suggest notes that directly fact-check claims in a post on Facebook, Instagram, or Threads. Other contributors will then rate a note as helpful or not helpful, determining in part whether the Community Note will appear to other users.\nMuch like X’s system, Meta’s Community Notes system evaluates which contributors normally disagree on posts. Using this information, Meta will only display a note if sides that typically oppose each other agree that a note is helpful.\nEven if a majority of Meta’s contributors believe a Community Note is needed, it doesn’t mean one will be shown. Further, Meta says it won’t downrank a post or account in its algorithms even if a community note is shown on a post.\nFor years, crowdsourced systems like Community Notes have been seen as a promising solutions to address misinformation on social media, but they have drawbacks.\nOn the positive side, researchers have found that people tend to see Community Notes as more trustworthy than flags from third-party fact checkers, according to a study published in the journal Science.\nIn another large scale study on X’s fact-checking system, researchers with the University of Luxembourg found that posts with Community Notes attached to them reduced the spread of misleading posts by 61%, on average.\nBut a lot of posts don’t get notes attached to them, or it takes too long. Because X, and soon Meta, require Community Notes to reach a consensus among contributors with opposing viewpoints, it often means that fact-checks are only added after a post has reached thousands or millions of people.\nThe same University of Luxembourg study also found that Community Notes may be too slow to intervene in the early and most viral stage of a post’s lifespan.\nA recent study from the Center for Counseling Digital Hate highlights the conundrum. Researchers took a sample of posts containing election misinformation on X and found that contributors suggested accurate, relevant information on these posts 81% of the time.\nYet of those posts that received suggestions, only 9% received consensus among contributors, meaning that a large majority of these posts didn’t appear with any fact checks.",
        "image": "https://techcrunch.com/wp-content/uploads/2025/03/GettyImages-2204064825.jpg?resize=1200,814",
        "categories": [
            "Apps",
            "Social"
        ],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 4
    },
    {
        "title": "Singapore grants bail for Nvidia chip smugglers in alleged $390M fraud",
        "created_at": "2025-03-13",
        "description": "A judge in Singapore granted bail to three men suspected of deceiving suppliers of server computers that may contain Nvidia chips affected by U.S. export",
        "authors": "Kate Park",
        "url": "https://techcrunch.com/2025/03/13/singapore-grants-bail-for-nvidia-chip-smugglers-in-alleged-390m-fraud/",
        "text": "A judge in Singapore granted bail to three men suspected of deceiving suppliers of server computers that may contain Nvidia chips affected by U.S. export rules that bar the sale of them to certain countries, as a route to halting them being sold to organizations in China.\nThe move comes nearly two weeks after the three men in the city-state were charged with smuggling Nvidia chips and committing fraud against Dell and Super Micro by falsely stating where the servers would be located.\nSingapore prosecutors said the fraud case involved servers provided by Singaporean companies and then moved to Malaysia, with transactions totaling about $390 million, per a report by Reuters. It is unclear what the final destination would be for those servers.\nThe bail for the two Singaporean men was set at S$800,000 ($600,000) and S$600,000 each, while the third man, a Chinese national, had his bail set at S$1 million. The next court hearing will be held on May 2.\nThe prosecution requested an eight-week delay to complete investigations and asked for specific conditions, including barring the men from airports or border checkpoints and prohibiting them from discussing the case if they are released on bail, per Bloomberg. The Chinese man reportedly must wear an electronic monitoring device.\nAccording to Nvidia’s latest annual report, Singapore accounted for 18% of revenue in the fiscal year that ended on January 28, despite shipments to the country making up less than 2% of sales.\nChina’s DeepSeek attracted global attention in the AI industry in January due to its advanced technology and cost-effective solutions, leading to heightened concerns around how and where it sources chips. DeepSeek‘s AI is powered by Nvidia’s chips, despite efforts to restrict exports and prevent the technology from being used in China.\nMalaysia said last week that it would take “necessary action” against Malaysian companies implicated in a fraud case related to the alleged transfer of Nvidia chips from Singapore to China.",
        "image": "https://techcrunch.com/wp-content/uploads/2022/02/GettyImages-957037038-nvidia.jpg?resize=1200,800",
        "categories": [
            "AI",
            "Enterprise"
        ],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 1
    },
    {
        "title": "Crypto wallet integrated with Telegram introduces crypto trading and yield features",
        "created_at": "2025-03-13",
        "description": "Telegram's crypto wallet, developed by a third-party company called The Open Platform (TOP), has introduced new features for people who don't just use",
        "authors": "Ivan Mehta",
        "url": "https://techcrunch.com/2025/03/13/telegram-introduces-trading-and-yield-features-for-its-self-custodial-crypto-wallet/",
        "text": "Telegram’s crypto wallet, developed by a third-party company called The Open Platform (TOP), has introduced new features for people who don’t just use Telegram as a messaging app. The updates include multi-asset trading and yield functionalities.\nBased on the TON blockchain, TOP launched the wallet in 2023. The company reported that over 100 million users have signed up for an account with Wallet on Telegram. Additionally, it noted that most of these users were new to the crypto ecosystem.\nThe wallet product has primarily been focused on the Toncoin cryptocurrency, which can be used on the Telegram platform to tip creators or pay for mini-games and apps. It also supports Bitcoin and USDT (on the TON blockchain). Since the initial launch, the wallet has also gained support of other currencies like Notcoin.\nFollowing today’s update, TOP says that users will be able to buy, sell, or hold crypto without any on-chain deposits. This makes it easier for newer users to get into crypto holding and trading.\nThe company is also introducing an earning component to the wallet for holding a certain amount of Toncoin. It said that while the average yield is 4%, it will vary based on validators’ reward. Later this year, TOP plans to add yields for USDT holdings and launch loyalty programs that would benefit Toncoin holders.\nTelegram Wallet has undergone a makeover as well, with a new navigation bar at the bottom and an easy way to switch between the Wallet, Trade, and Earn sections.\n“This update enhances Wallet’s functionality, to meet consumers’ expectations for an open and wide market. With current update Wallet now operates as a fully-fledged crypto platform within Telegram while remaining as simple and accessible as ever. We also plan to implement a loyalty program specifically for Toncoin holders, to further boost the adoption of TON Ecosystem,” TOP’s CEO Andrew Rogozov said in a statement.\nThe new wallet update will start rolling out to users in March and April. TOP said that some features might be restricted in some countries based on local regulations.\nLast December, Telegram founder Pavel Durov said that the company became profitable. The platform has more than 950 million monthly active users. Cryptocurrencies have contributed to the company’s bottom-line thanks to integrations with content and mini app payments.\nThe story is updated after the company’s input on yield and self-custody.",
        "image": "https://techcrunch.com/wp-content/uploads/2025/03/Telegram-wallet.jpg?resize=1200,675",
        "categories": [
            "Apps",
            "Crypto"
        ],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 1
    },
    {
        "title": "Xiaomi to preinstall PhonePe's app store on smartphones sold in India",
        "created_at": "2025-03-13",
        "description": "Chinese smartphone maker Xiaomi said on Thursday that its Android smartphones sold in India will come preinstalled with Indian fintech company PhonePe's",
        "authors": "Ivan Mehta",
        "url": "https://techcrunch.com/2025/03/13/xiaomi-to-preinstall-phonepes-app-store-on-smartphones-sold-in-india/",
        "text": "Chinese smartphone maker Xiaomi said on Thursday that its Android smartphones sold in India will come preinstalled with Indian fintech company PhonePe’s app store.\nXiaomi’s Android smartphones usually come preinstalled with Google’s Play Store and the Chinese company’s own GetApps. Xiaomi said that it has signed a multi-year deal with PhonePe to replace GetApps with the latter’s Indus Appstore. This confirms TechCrunch’s reporting last year about the partnership.\nGoogle’s Play Store will still come preinstalled on Xiaomi’s devices. The companies did not specify if the Indus Appstore would also be rolled out to existing Xiaomi devices that have already been sold or are currently available to buy at retailers. They also did not mention when this will come into effect.\nPhonePe has been trying to take on the likes of Google for a share of the Indian app market, promising to charge zero fees from developers for in-app purchases. Indus Appstore supports 12 Indian languages, features a video-led discovery feed, and has more than 500,000 apps across different categories.\nHowever, alternative app stores have found it difficult to scale because it takes time to establish trust with users and convince users to install yet another app store. PhonePe is trying to get over at least one of those hurdles by having its app store be preinstalled on new smartphones. The fintech has so far not published any numbers to indicate how many downloads and money its app store is garnering for developers.\n“As India’s digital ecosystem continues to grow, the demand for a locally driven app marketplace has never been more critical. At Xiaomi India, we have always championed ‘Make for India’ innovations, and this partnership with Indus Appstore is a strategic step in that direction,” Xiaomi India’s COO, Sudhin Mathur, said in a statement.",
        "image": "https://techcrunch.com/wp-content/uploads/2024/02/phonepe-indus-appstore.jpg?resize=1200,562",
        "categories": [
            "Apps",
            "Gadgets"
        ],
        "source": "techcrunch",
        "topic": "tech",
        "estimatedReadingTime": 1
    }
]